{
  "+2VHUU": {
    "description": "{executionLayer} is a link labeled 'execution layer'. {consensusLayer} is a link labeled 'consensus layer'",
    "message": "Ethereum consists of the {executionLayer} (handling transactions and execution, formerly 'Eth1'), and the {consensusLayer} (handling proof-of-stake consensus tasks, formerly 'Eth2' or 'Ethereum 2.0')."
  },
  "+EZ9E/": {
    "message": "Interactive mode"
  },
  "+L0IkF": {
    "message": "Step 2: Generate deposit keys using the Ethereum Foundation deposit tool"
  },
  "+UUcBt": {
    "message": "Choose a language"
  },
  "+V+ZX+": {
    "message": "Validator uptime"
  },
  "+e8bO+": {
    "message": "I understand that I will not be able to withdraw my funds if I lose my mnemonic phrase."
  },
  "+fnRDB": {
    "message": "I accept"
  },
  "+mDtA4": {
    "message": "6. Wait to become active"
  },
  "+ozGrs": {
    "message": "Polish"
  },
  "+vHhHz": {
    "message": "Validator management"
  },
  "+wJuhm": {
    "message": "Discord:"
  },
  "/+atl4": {
    "message": "Recommendation disclaimer"
  },
  "//KCTE": {
    "message": "You can start all the transactions at once, or start them individually."
  },
  "/4e3mN": {
    "message": "Since The Merge, validators will also be responsible for processing transactions, and thus be entitled to unburnt gas fees associated with included transactions when proposing blocks. These fees are accounted for on the execution layer, not the consensus layer, and thus require a traditional Ethereum address to be provided to your client."
  },
  "/5Hyyf": {
    "message": "Indonesian"
  },
  "/JiR8D": {
    "message": "On a never-ending loop, every single validator account is continuously evaluated for eligible ETH withdrawals (of which there are two types, more on this below). Validators are processed in order by index number, originally starting at 0, with each subsequent proposer picking up where the last one left off."
  },
  "/OAba6": {
    "message": "Note the “activation” and “exit” queues are independent and do not compete. Each are limited on a per-epoch basis."
  },
  "/SbhtD": {
    "message": "You can also use {homebrew} to install pip3. For the most-up-to-date instructions on installing pip3, and for a direct download link, reference the {docs}"
  },
  "/U09hN": {
    "message": "To avoid exposing your validator identity to the network, you can use a trustworthy VPN to help reduce the risk of revealing your IP address."
  },
  "/VVB8t": {
    "message": "Review this section before deciding to proceed with validator setup."
  },
  "/Vc/P6": {
    "message": "Sorry, this page does not exist."
  },
  "/WenEu": {
    "message": "You are responsible for the transaction. Fraudulent websites might try and lure you into sending the {pricePerValidator} to them, instead of the official deposit contract. Make sure that the address you are sending the transaction to is the correct address."
  },
  "/Z5X80": {
    "description": "{testnet} shows '--config holesky' terminal command",
    "message": "Use {testnet} to sync the Holesky testnet."
  },
  "/e+qAC": {
    "message": "withdrawable epoch"
  },
  "/h0DGY": {
    "message": "Why the {pricePerValidator} ETH maximum?"
  },
  "/jJLYy": {
    "message": "Transactions"
  },
  "/jlnsn": {
    "message": "You can also use the Beaconcha.in broadcasting tool to upload your message using a web user interface:"
  },
  "/rmnC0": {
    "message": "If at all possible, consider running another client at this time to help protect yourself and the network."
  },
  "/tHxib": {
    "message": "Geth is one of the three original implementations of the Ethereum protocol, written in Go."
  },
  "/ub26/": {
    "message": "Understand the risks"
  },
  "/w/KT4": {
    "description": "{eip2334} shows 'EIP2334' and links to EIP documentation. {strongText} is important information bolded for emphasis",
    "message": "However, all is not lost. Assuming you derive your keys using {eip2334} (as per the default onboarding flow) then {strongText}."
  },
  "/wNiYN": {
    "message": "The deposit contract has been verified at a byte-code level to ensure your safety."
  },
  "/ydZdf": {
    "message": "How large are the rewards/penalties?"
  },
  "00OWFk": {
    "message": "Minimum top-up value is {minTopupValue} {TICKER_NAME}."
  },
  "00d8uq": {
    "message": "Once set up, your validator won't become active straight away. Use this time to complete the checklist and get some extra practice on a testnet."
  },
  "03xT/J": {
    "message": "The idea behind this is to minimize the losses from honest mistakes, but strongly disincentivize coordinated attacks."
  },
  "07C4IQ": {
    "message": "Section 3 - After depositing"
  },
  "09ZPhN": {
    "message": "Withdrawal credentials:"
  },
  "0Em8Cd": {
    "message": "As of {date}, the Mainnet execution chain data alone is approaching 2TB (growing at >1GB/day). A 2TB SSD is a minimum requirement, while 4TB is now recommended."
  },
  "0FTs1T": {
    "message": "not"
  },
  "0GWhvr": {
    "message": "Expected outputs"
  },
  "0PlVao": {
    "message": "More on slashing prevention"
  },
  "0RmIrh": {
    "message": "Your deposit_data.json suggests you wanted to set up one more validator. This deposit is still outstanding. If you think you've already made this deposit, wait an hour before trying again to avoid duplicate deposits."
  },
  "0S8/Wo": {
    "message": "Testnet practice"
  },
  "0U17DC": {
    "message": "withdrawal credentials"
  },
  "0WPDnu": {
    "message": "You should certainly top up if your balance is close to {EJECTION_PRICE} ETH. This is to ensure you don’t get kicked out of the validator set (which automatically happens if your balance falls below {EJECTION_PRICE} ETH)."
  },
  "0XRY0E": {
    "message": "If your mnemonic is stolen/compromised, and you have not yet set a withdrawal address, you should attempt this {immediately} to prevent permanent lose of funds, before the attacker irreversibly designates their own withdrawal address for your validator."
  },
  "0fkPmg": {
    "message": "Reth is a modular, contributor-friendly and blazing-fast implementation of the Ethereum protocol, written in Rust."
  },
  "0i4cCJ": {
    "message": "Confirm deposits ({depositKeys})"
  },
  "0kxaf/": {
    "message": "I've provided an Ethereum address to my validator where I would like my fee rewards to be deposited."
  },
  "0lHkrT": {
    "message": "Second, install the dependency packages:"
  },
  "0oNdmk": {
    "message": "Validators FAQ"
  },
  "0uqjBl": {
    "message": "Earn continuous rewards for providing a public good to the community."
  },
  "0wEZ8X": {
    "message": "Verify on {NETWORK_NAME}"
  },
  "122+yR": {
    "message": "withdrawal key"
  },
  "14vTrX": {
    "message": "While validating on the testnet, perform these simulations to learn more about your node, and better prepare yourself for Mainnet:"
  },
  "15B2Xk": {
    "message": "Stakers must set a withdrawal address to unlock reward payments from the consensus layer. This is set when generating your validator keys."
  },
  "17Epwt": {
    "message": "{TESTNET_LAUNCHPAD_NAME} testnet"
  },
  "192AR6": {
    "message": "More on staking"
  },
  "19o6KO": {
    "message": "When can I withdraw my funds, and what’s the difference between exiting and withdrawing?"
  },
  "1FdDAV": {
    "message": "JSON RPC endpoint"
  },
  "1G0loj": {
    "message": "If you do not provide an address to your client, you will not receive transaction fees when your validator proposes blocks."
  },
  "1ONfru": {
    "message": "To include this message on Mainnet, you will need to upload this message to a beacon node’s message “Signed BLS To Execution Change” pool."
  },
  "1P6GMj": {
    "message": "Monitoring"
  },
  "1PPGHb": {
    "message": "I've verified my server time matches the wall clock."
  },
  "1QW89r": {
    "message": "More stats"
  },
  "1UmyRL": {
    "message": "latest stable software release"
  },
  "1VJ05X": {
    "message": "Section 3"
  },
  "1Vkpd0": {
    "message": "Check that the password files don’t have trailing new-lines."
  },
  "1Yybuc": {
    "message": "docs of full arguments here"
  },
  "1fDfw7": {
    "message": "How does this all happen?"
  },
  "1fytak": {
    "message": "Check deposit contract details"
  },
  "1ingnQ": {
    "message": "More on Ethereum staking economics"
  },
  "1p+pb5": {
    "message": "fee recipient"
  },
  "1pUw7Y": {
    "message": "Documentation on running Nethermind"
  },
  "2/VDay": {
    "message": "Max validators per withdrawals sweep: 16,384 (2{exp})"
  },
  "21EI3f": {
    "message": "Lodestar validator key management documentation"
  },
  "22EpKq": {
    "description": "{JSON} is filetype extension",
    "message": "This isn't a valid {JSON} file"
  },
  "25suT4": {
    "description": "The {semicolon} and {colon} variables refer to the keyboard characters ';' and ':'.",
    "message": "The path separator is operating system dependent, and should be {semicolon} in Windows rather than {colon}."
  },
  "28aik1": {
    "message": "Rate-limits set on withdrawal queue"
  },
  "2A6Wjz": {
    "message": "By providing this flag, your withdrawal credentials will contain the {type1} prefix and your withdrawal address, signaling that your account is ready for withdrawals."
  },
  "2AHkym": {
    "message": "There was an error loading your validator information from Beaconcha.in"
  },
  "2CYEJa": {
    "message": "Troubleshooting"
  },
  "2HVWJL": {
    "message": "execution layer"
  },
  "2Hk0nB": {
    "message": "Follow the instructions presented to you in the application to generate your keys."
  },
  "2PI6Di": {
    "message": "Consensus Clients: {clientName}"
  },
  "2RXbJd": {
    "message": "What factors affect the frequency of payouts?"
  },
  "2XWJdH": {
    "message": "If so, move to next question"
  },
  "2c8F5x": {
    "message": "Fee recipient docs:"
  },
  "2ebz/N": {
    "message": "excess balance withdrawal"
  },
  "2rflCq": {
    "message": "Client diversity is extremely important for the network health of Ethereum: A bug in a client with a share of over 33% can cause Ethereum to go offline. If the client has a supermajority (>66%), a bug could cause the chain to incorrectly split, potentially leading to slashing."
  },
  "2t/3ab": {
    "message": "The other file you just generated is {depositDataJson}. This file contains the public key(s) associated with your validator(s); You will need to upload this in the next step."
  },
  "32rBNK": {
    "message": "Terms of Service"
  },
  "36P4ra": {
    "message": "Over time, your balance will decrease as you are penalized for not participating in the consensus process. When your balance reaches {EJECTION_PRICE} ETH, you will be automatically exited from the validator set."
  },
  "38Fedn": {
    "message": "More on ChainSafe"
  },
  "38VH2G": {
    "message": "Install deposit-cli tool"
  },
  "39ZKg5": {
    "message": "Withdrawals"
  },
  "3CRtg8": {
    "message": "You do not have enough {eth} in this account for {numberOfValidators} {validator}"
  },
  "3GbrWR": {
    "message": "Why do rewards depend on the total number of validators in the network?"
  },
  "3H3ygi": {
    "message": "No validators found for your connected wallet"
  },
  "3KP7+U": {
    "message": "Command line with flags"
  },
  "3ODqP9": {
    "message": "Depositing more than {pricePerValidator} ETH to a single set of keys does not increase rewards potential, nor does accumulating rewards above {pricePerValidator} ETH, as each validator is limited to an {effectiveBalance} of {pricePerValidator}. This means that staking is done in {pricePerValidator} ETH increments, each with its own set of keys and balance."
  },
  "3PbtmF": {
    "message": "Check the whole address, not just a portion of it. There could be just a few bytes different."
  },
  "3Q43SM": {
    "message": "Become a validator"
  },
  "3QmqFf": {
    "message": "Top-up transaction"
  },
  "3SOKyg": {
    "message": "These terminology updates only change naming conventions; this does not alter Ethereum's goals or roadmap."
  },
  "3aykgN": {
    "message": "Your validator will also receives unburnt gas fees when proposing blocks. Validators are chosen randomly by the protocol to propose blocks, and only one validator can propose a block for each 12-second slot. There are 7200 slots each day, so each validator has 7200 chances-per-day to propose a block. If there are 500,000 validators, each validator will {average} a block proposal every 70 days."
  },
  "3fRpn0": {
    "message": "Reth Audit Report"
  },
  "3tR/V9": {
    "message": "Section 2 - During setup"
  },
  "3zCA2i": {
    "description": "{code} values are terminal outputs and commands.",
    "message": "If you see error message {code1}, you may need to install {code2} or {code3} package."
  },
  "3zWAPC": {
    "message": "you can always recalculate your signing key from your mnemonic"
  },
  "4+3cIr": {
    "message": "You've successfully set up a testnet validator! We recommend you complete the checklist before validating on {mainnet}"
  },
  "40/5Sf": {
    "message": "Note that your {withdrawalCredentials} are not the same as your {feeRecipient}, which receives transaction fees from proposed blocks. These can both be set to the same address, but must each be set separately."
  },
  "47svuN": {
    "message": "Installation"
  },
  "4AVfh5": {
    "message": "I've joined my consensus client's Discord server."
  },
  "4NvAhl": {
    "message": "Start by setting up your chosen hardware and operating system."
  },
  "4QNsja": {
    "message": "Why a sliding scale? While we won’t get into the gory details here, the basic intution is that there needs to be a minimum number of validators (and hence a minimum amount of ETH staked) for the network to function properly. So, to incentivize more validators to join, it’s important that the interest rate remains high until this minimum number is reached."
  },
  "4hb+GK": {
    "message": "Withdrawal address"
  },
  "4hnEBA": {
    "message": "Has the smart contract code been verified?"
  },
  "4kNER3": {
    "message": "Any exit, voluntary or not, must be processed through the exit queue. This is not instantaneous, and depends on how many other accounts are exiting at the same time."
  },
  "4l6vz1": {
    "message": "Copy"
  },
  "4uFys5": {
    "message": "Accounts that have been slashed, or have insufficient balance, will be forced to exit according to the network rules. This is automatic and cannot be stopped once initiated."
  },
  "57MWKW": {
    "message": "Withdrawals as an operation, not a new transaction type"
  },
  "57h5ur": {
    "message": "Then up to {time} for the next validator sweep to execute the full withdrawal (assumes {type1} withdrawal credentials)"
  },
  "58PXVy": {
    "message": "Why two keys instead of one?"
  },
  "5A6amM": {
    "message": "It is high risk to run your validator in multiple places. It will lead to a slashable event and ejection from the network. {learnMore}"
  },
  "5CdqwI": {
    "message": "Nimbus beacon node documentation"
  },
  "5H/J84": {
    "message": "How do you want to generate your keys?"
  },
  "5HJLBU": {
    "message": "Teku installation documentation"
  },
  "5KtHYT": {
    "message": "If this is not provided now, your deposited funds will remain locked on the Beacon Chain until an address is provided. Unlocking will require signing a message with your withdrawal keys, generated from your mnemonic seed phrase (so keep it safe)."
  },
  "5UH1sh": {
    "message": "Romanian"
  },
  "5Vrs8S": {
    "message": "You need enough upload bandwidth too. As of {date} this is ~1.2-1.3 GB download and ~0.9-1 GB upload per hour, and is likely to increase."
  },
  "5q9Lgv": {
    "message": "Download {master} branch:"
  },
  "5t8oYl": {
    "description": "{variables} are social media platform links to Discord and Reddit (do not translate names)",
    "message": "Visit EthStaker on {discord} or {reddit} at any time during your setup for some friendly help!"
  },
  "5v36Is": {
    "message": "Exiting a {client} validator"
  },
  "63gLLu": {
    "message": "average"
  },
  "6NndcB": {
    "message": "leave"
  },
  "6NyPVb": {
    "message": "Nimbus is a client implementation for both execution and consensus layers that strives to be as lightweight as possible in terms of resources used. This allows it to perform well on embedded systems, resource-restricted devices—including Raspberry Pis—and multi-purpose servers."
  },
  "6S95Bo": {
    "message": "Avoid phishing"
  },
  "6UUL73": {
    "message": "More on validators"
  },
  "6VIBSR": {
    "message": "You can improve the effective balance of this validator by topping up"
  },
  "6eA+mW": {
    "message": "Lodestar is built using TypeScript under a GNU Lesser General Public License v3.0."
  },
  "6glcFX": {
    "message": "How to join the public testnet"
  },
  "6nh4de": {
    "message": "You're joining a network in its early stages. As with any new piece of software, there is the potential for software bugs. While unlikely, potential bugs may result in slashing."
  },
  "6stJTU": {
    "description": "{testnet} shows '--network=holesky' terminal command",
    "message": "Use {testnet} to sync the Holesky testnet."
  },
  "6vdHjj": {
    "message": "{withdrawalCredentials} is a 32-byte field associated with every validator, initially set during deposit, for verifying the destination of valid withdrawals. Currently, there are two types of withdrawal credentials: BLS credentials (Type 0, or {type0}) and execution (Ethereum address) credentials (Type 1, or {type1})."
  },
  "7+Domh": {
    "message": "Notes"
  },
  "738tqz": {
    "message": "Prysm is written in Go and released under a GPL-3.0 license."
  },
  "74QdCu": {
    "message": "Transaction started"
  },
  "793QlI": {
    "message": "{title} is not supported in offline mode."
  },
  "7DFXQj": {
    "message": "Switch to {oppositeNetwork} launchpad"
  },
  "7EpPjk": {
    "message": "Reth Releases"
  },
  "7FcGxU": {
    "description": "{executionLayer} is a link labeled 'execution client'. {consensusLayer} is a link labeled 'consensus client'",
    "message": "You need to run an {executionClient} as well as your {consensusClient}."
  },
  "7GLK15": {
    "message": "Depending which method you use to generate your keys:"
  },
  "7Iz3JI": {
    "message": "Consensus Client"
  },
  "7Nwe5A": {
    "message": "{exitEpochLabel} - epoch at which your validator is no longer active, no longer earning rewards, and is no longer subject to slashing rules."
  },
  "7Rw2uA": {
    "message": "consensus"
  },
  "7UOvbT": {
    "message": "Offline"
  },
  "7V/8wz": {
    "message": "Configuration file"
  },
  "7XiYRi": {
    "message": "Slashed?"
  },
  "7d3Nzd": {
    "description": "{variables} are Beacon Chain block explorers, with links to each (do not translate names)",
    "message": "You can use your validator client's graffiti flag to add a personal touch to your proposed blocks (some text of your choice). You will be able to see it using {beaconchain} or {beaconscan} blockchain explorers."
  },
  "7dUCnj": {
    "message": "Reth 1.0 was audited by Sigma Prime over the course of >8 weeks in May 2024, link below."
  },
  "7kWKe0": {
    "message": "The withdrawal queue is automatically filled and processed by block proposers, who automatically check for any available payouts via a sweeping mechanism."
  },
  "7sZfCF": {
    "message": "More on Nimbus"
  },
  "7tRtDE": {
    "message": "Every epoch, the network measures the actions of each validator and issues your rewards or penalties appropriately."
  },
  "8/nhr4": {
    "message": "For your validator to be capable of withdrawals of any kind, a withdrawal address must be provided and registered to your account on the Beacon Chain. This should be an address you control, and cannot be changed once set."
  },
  "80eWKU": {
    "message": "True balance"
  },
  "82vl9l": {
    "message": "We can't detect MetaMask. Switch browsers or install MetaMask."
  },
  "8BXroN": {
    "message": "Lodestar documentation"
  },
  "8FjJDx": {
    "message": "Bad behavior"
  },
  "8FmuYF": {
    "message": "Install pip3"
  },
  "8HxLGA": {
    "message": "Configure Teku"
  },
  "8JtiQS": {
    "message": "Does the contract address listed on the website match?"
  },
  "8Rj/6A": {
    "message": "Choose the OS of the computer you're currently using. This will be the computer you use to generate your keys. It doesn't need to be the OS you want to use for your node."
  },
  "8WtyrD": {
    "message": "Spanish"
  },
  "8boRAk": {
    "message": "slashings"
  },
  "8echXf": {
    "message": "Do not turn your validator off until this epoch is reached."
  },
  "8k1RjX": {
    "message": "{NETWORK_NAME} testnet"
  },
  "8kLV25": {
    "message": "Has a withdrawal address been provided?"
  },
  "8mEWVB": {
    "message": "Given a fixed total number of validators, the rewards/penalties predominantly scale with the balance of the validator—attesting with a higher balance results in larger rewards/penalties whereas attesting with a lower balance results in lower rewards/penalties."
  },
  "8mybVV": {
    "message": "{type0} = \"Type 0\" = BLS keys = Old withdrawal credentials: {withdrawalsDisabled}"
  },
  "8rxaqc": {
    "message": "{withdrawableEpochLabel} - epoch at which your validator funds are eligible for a full withdrawal during the next validator sweep."
  },
  "8uq59n": {
    "message": "Signal your intent to exit staking by signing and broadcasting a voluntary exit message to the network using your validator keys and validator client"
  },
  "8wd0q5": {
    "message": "An Ethereum client designed to be enterprise-friendly for both public and private, permissioned network use cases."
  },
  "8yom7x": {
    "message": "Run the Wagyu Key Gen app from withing Applications by right clicking and clicking Open. You will get a warning stating macOS cannot verify the developer of “Wagyu Key Gen.app”. Are you sure you want to open it?. Click Open and the app will open."
  },
  "9+Ddtu": {
    "message": "Next"
  },
  "9/yem6": {
    "message": "If you try to cheat the system, or act contrary to the specification, you will be liable to incur a penalty known as slashing*. Running your validator keys simultaneously on two or more machines will result in slashing."
  },
  "94dQms": {
    "message": "For security, we recommend you disconnect from the internet to complete this step."
  },
  "9DZdsc": {
    "message": "Is there any advantage to having more than {pricePerValidator} ETH at stake?"
  },
  "9JktQX": {
    "message": "There is no easy answer to this question as there are many factors that go into this calculation."
  },
  "9MIPCp": {
    "message": "If you do not provide a withdrawal address with your initial deposit data, you will need to derive your withdrawal keys from your mnemonic at a later time, so {boldWarning}—it will be the ONLY way to withdraw your {TICKER_NAME} when you chose to activate withdrawals."
  },
  "9RBO+X": {
    "message": "Review validator roles and responsibilities"
  },
  "9Ur2de": {
    "message": "Adding a withdrawal address with Wagyu Key Gen"
  },
  "9VZ9oy": {
    "message": "How are validators incentivized to stay active and honest?"
  },
  "9h8yTf": {
    "message": "A “withdrawable epoch” will also be calculated, which is 256 epochs after the calculated exit epoch (~27.3 hours later). When this epoch is reached, your validator will be eligible for a {fullWithdrawal} of all remaining funds."
  },
  "9jnVGr": {
    "message": "Typically a minimum of 32 GB RAM is required, with 64 GB being recommended."
  },
  "9k7tO9": {
    "message": "Wrong network"
  },
  "9lBMQr": {
    "message": "{keyFile} of paths via the {validatorsKeys} option."
  },
  "9mLaI9": {
    "message": "deposit"
  },
  "9oWUO0": {
    "message": "This will start the process of ending your commitments on the network. An “exit epoch” will be calculated based on how many other validators are exiting at the same time. When this epoch is reached, your validator account will no longer be eligible for rewards, and will no longer be at risk of losing funds from being offline."
  },
  "9qMyhY": {
    "message": "Read options and subcommands documentation"
  },
  "9qpi9h": {
    "message": "Configure Nethermind"
  },
  "9r6K1F": {
    "message": "Not eligible for withdrawals"
  },
  "9r8j5+": {
    "message": "Engine API"
  },
  "9uOFF3": {
    "message": "Overview"
  },
  "9vwGlT": {
    "message": "I've synced my beacon node on {consensusLayerName}."
  },
  "9ySJSP": {
    "description": "{ethClientType} is either \"execution\" or \"consensus\", depending on which step user is on",
    "message": "Choose your {ethClientType} client and set up a node"
  },
  "A2b4uB": {
    "message": "Send deposit"
  },
  "A6Oppp": {
    "message": "Prysm offers step-by-step guidelines to run their client after completing your deposit through the launchpad."
  },
  "A8r7Hg": {
    "message": "consensus layer"
  },
  "AC669U": {
    "message": "If you need help, check out the Python documentation."
  },
  "AEbKyt": {
    "message": "For devnet, you can add a param:"
  },
  "AFzWcM": {
    "message": "I understand that keys are my responsibility and that my mnemonic (seed) will be the {onlyWay} to withdraw my funds if I don't provide a withdrawal address with initial deposit data."
  },
  "AH6XsN": {
    "message": "Also be sure you understand how staking withdrawals work before setting up your keys and deposit data."
  },
  "AJD+66": {
    "message": "The Ethereum staking deposit contract requires a minimum of {minTopupValue} {TICKER_NAME} to be sent at one time to be accepted."
  },
  "ATwOPg": {
    "message": "execution client"
  },
  "AYKxmf": {
    "message": "Connect your hardware wallet to Metamask"
  },
  "AZaw+B": {
    "message": "Exiting"
  },
  "AbBgEs": {
    "message": "understanding validator effective balance"
  },
  "Ad61gz": {
    "description": "{url} is link to GitHub CLI release, made bold for emphasis",
    "message": "Please make sure that you are downloading from the official Ethereum Foundation GitHub account by verifying the url: {url}"
  },
  "Affixg": {
    "message": "The deposit"
  },
  "AkVktj": {
    "message": "Check deposit contract address"
  },
  "An37jY": {
    "message": "Specifically, when starting your lighthouse validator client, you can point it at the directory with your keystores and it will import your keystores and interactively ask for your password(s). If you do not supply a password, lighthouse will ask for it again every time it starts up."
  },
  "Andk3R": {
    "message": "If you do not provide a withdrawal address prior to depositing, you will have to perform an additional step to update your keys and enable withdrawals. Funds will be locked in the meantime."
  },
  "Anqi3n": {
    "message": "Become a validator with Lighthouse"
  },
  "Aq9Prx": {
    "description": "{minTopupValue} is a number, and {TICKER_NAME} is either ETH or a variation of ETH depending on network",
    "message": "Validator effective balance is currently maxed out. If desired, you may add {minTopupValue} {TICKER_NAME} (the minimum allowed by the deposit contract)"
  },
  "Aw1mMs": {
    "message": "Top up validator"
  },
  "BCsPjJ": {
    "message": "Start deposit process"
  },
  "BFAvr/": {
    "message": "Top up a validator"
  },
  "BFsUAH": {
    "description": "{code} values are terminal outputs to look for, should not translate",
    "message": "Check if {code1} is {code2}."
  },
  "BHR1uy": {
    "message": "Erigon is written in Go and licensed under the GNU LGPLv3."
  },
  "BKDxOx": {
    "message": "Once a validator has exited and its full balance has been withdrawn, any additional funds deposited to that validator will automatically be transferred to the withdrawal address during the next validator sweep. To re-stake ETH, a new validator must be activated."
  },
  "BPpnlJ": {
    "message": "Download MetaMask"
  },
  "BQXsbH": {
    "message": "The key start index in EIP-2334"
  },
  "BUFaRV": {
    "message": "EthStaker community"
  },
  "Bc20la": {
    "message": "days"
  },
  "BhWRLC": {
    "message": "Importantly, as a validator you'll need to post {TICKER_NAME} as collateral—in other words, have some funds at stake. The only way to become a validator is to make a one-way {TICKER_NAME} transaction to the {DEPOSIT_CONTRACT} on the {NETWORK_NAME} execution layer. The Beacon Chain (consensus layer) is used in parallel to keep track of all validator activity."
  },
  "Bj5yI5": {
    "message": "Effective balance"
  },
  "BnwOUO": {
    "message": "execution"
  },
  "BoEpk9": {
    "message": "Introduction"
  },
  "Bp0clV": {
    "message": "Validator index:"
  },
  "Bp9Dxf": {
    "message": "How to trigger withdrawals, credential change"
  },
  "Bxe+HB": {
    "message": "Genesis validator root"
  },
  "C/gb74": {
    "message": "Configure Lighthouse"
  },
  "C3jBPI": {
    "message": "Execution Client"
  },
  "C9fTX1": {
    "message": "Answers to common questions on becoming a validator."
  },
  "CACPC+": {
    "message": "Czech"
  },
  "CDx/FY": {
    "message": "By running a validator, you'll be responsible for securing the network and receive continuous payouts for actions that help the network reach consensus."
  },
  "CF9vMR": {
    "message": "Proof of stake"
  },
  "CGMYrU": {
    "message": "Staking Deposit CLI releases"
  },
  "CPl2hh": {
    "message": "I have reviewed the checklist and understand how withdrawals work."
  },
  "CT+gEC": {
    "message": "Upload to Beacon Node {btec} pool"
  },
  "CWKE9c": {
    "message": "Your wallet is on the wrong network. Switch to {executionLayerName}"
  },
  "Cacfkx": {
    "message": "More on the Ethereum vision"
  },
  "CdKEd/": {
    "description": "{strongText} is a warning, bolded for emphasis",
    "message": "The minimum amount that can be slashed is 1 ETH, but {strongText}."
  },
  "CeeJfw": {
    "message": "I've set up a firewall."
  },
  "Cgrsge": {
    "message": "Current validators"
  },
  "Co67tK": {
    "message": "BLS To Execution Change"
  },
  "D0Rigq": {
    "message": "NO"
  },
  "D33f/7": {
    "description": "APR refers to Annual Percentage Rate",
    "message": "Current APR"
  },
  "D4cQV/": {
    "message": "How much ETH do I need to stake to become a validator?"
  },
  "DCaq7N": {
    "message": "Your wallet is connected to the right network!"
  },
  "DGHD9y": {
    "message": "Lighthouse has dedicated tooling to make the transfer from the Launchpad as easy as possible."
  },
  "DKSrR+": {
    "message": "I understand that if I act contrary to the specification, I am liable to be slashed."
  },
  "DNRQa7": {
    "message": "I have read and agree to the Launchpad terms of service."
  },
  "DUnyVI": {
    "message": "Ideally your internet connection should be reliable and as close to 24/7 as possible without interruption."
  },
  "Dayq/y": {
    "message": "Configure Erigon"
  },
  "DbnQg+": {
    "message": "Verify the contract address"
  },
  "DhKDS3": {
    "message": "Proof-of-stake and the Beacon Chain"
  },
  "Di1/yX": {
    "message": "Consensus JWT docs:"
  },
  "DiXOHD": {
    "message": "Documentation for building, running and debugging Reth"
  },
  "DjhC7F": {
    "message": "I've forwarded the necessary ports to the correct machine(s) from my router for both my EL and CL client (only open the ports that apply to your installations)."
  },
  "DmKneH": {
    "message": "The clients support Prometheus and Grafana to help you visualize important real-time metrics about your validator."
  },
  "DsJ/Mk": {
    "message": "Don’t just trust the contract address listed on this website."
  },
  "E+Y27g": {
    "message": "You can check your Python version by typing {terminalCommand} in your terminal."
  },
  "E/P9zo": {
    "message": "3. Practice on a testnet"
  },
  "E1Mywn": {
    "description": "this is used as a command line flag",
    "message": "chain"
  },
  "E4rtgi": {
    "message": "Consensus clients:"
  },
  "EIUapL": {
    "description": "{deposit} = 'deposit' styled as code",
    "message": "Use the terminal to move into the directory that contains the {deposit} executable"
  },
  "EMCxvJ": {
    "description": "{testnet} shows '--chain holesky' terminal command",
    "message": "Use {testnet} to sync the Holesky testnet."
  },
  "EPCHZV": {
    "message": "If you lose your signing key, your validator can no longer propose or attest."
  },
  "EPlepr": {
    "message": "I've simulated power loss (server and internet) and automatic resumption."
  },
  "ER2q1V": {
    "message": "The Merge upgrade officially brought proof-of-stake to Ethereum on September 15, 2022, simultaneously deprecating proof-of-work. This prepared the chain for future scaling upgrades such as Danksharding by bringing proof-of-stake consensus together with Mainnet, while simultaneously reducing energy consumption by over 99.9%."
  },
  "ETJ2T5": {
    "message": "If you have questions about deposit-cli, please visit the GitHub repository."
  },
  "EThT2C": {
    "message": "5. Time to deposit"
  },
  "EXLB88": {
    "message": "This is a test network ⚠️"
  },
  "EXt8Xd": {
    "message": "Stakers must provide a fee recipient address to their consensus client in order to receive transaction fee rewards. This is a normal Ethereum address that you're used to."
  },
  "EcCME0": {
    "message": "Staking Launchpad"
  },
  "Ej2jo1": {
    "message": "Withdrawal address:"
  },
  "EsxlJB": {
    "message": "Configure Reth"
  },
  "F8yf1S": {
    "message": "You can find {docsHere}."
  },
  "FEbVwB": {
    "message": "The key concept is the following:"
  },
  "FM92S0": {
    "message": "Note: the Beacon Chain may take several minutes to verify your deposit"
  },
  "FSRfSJ": {
    "message": "I understand that this transaction is not reversible."
  },
  "FU7JYy": {
    "description": "{flag} is a terminal command styled as code.",
    "message": "Make sure you have set {flag} for {consensusLayerName}, otherwise the deposit will be invalid."
  },
  "FWtWw3": {
    "message": "Note the “withdrawal” and “BLS To Execution Change” queues are independent and do not compete. Each are limited on a per-block basis."
  },
  "FZCdw+": {
    "message": "Your validator indices"
  },
  "FZa0R+": {
    "message": "This scenario is very extreme and unlikely to happen."
  },
  "Fa2pjg": {
    "message": "The config file CLI argument"
  },
  "FazwRl": {
    "message": "Try again"
  },
  "FcCHp4": {
    "message": "Latest data on network client usage"
  },
  "Felr8P": {
    "message": "A {validatorClient} is the software that acts on behalf of the validator by holding and using its private key to make attestations about the state of the chain. A single validator client can hold many key pairs, controlling many validators."
  },
  "FfLWt5": {
    "message": "An Ethereum client with a huge pool of developers. It's perfect for enterprise-grade systems."
  },
  "FgraU0": {
    "message": "Step 1: Download the deposit command line interface app for your operating system"
  },
  "FmGmFH": {
    "message": "Your wallet should be set to {executionLayerName} to use this launchpad."
  },
  "Fogk92": {
    "message": "Max withdrawals per payload: 16 (2{exp})"
  },
  "FqgDIV": {
    "message": "Terms of service"
  },
  "FzkbsB": {
    "message": "validators"
  },
  "G0ZD5H": {
    "message": "To make an account eligible for a full withdrawal, the validator account must first be exited. Validator accounts can be exited from staking in two main ways: voluntarily or forcefully."
  },
  "G5IMoZ": {
    "message": "Download master branch source code"
  },
  "G8tAKU": {
    "message": "Choose client"
  },
  "GBXzeJ": {
    "message": "Arguably the most impactful factor on rewards earned for validating transactions is the total amount of stake in the network. In other words, the total amount of validators. Depending on this figure the max annual return rate for a validator can be anywhere between 2 and 20%."
  },
  "GDaRAW": {
    "message": "Make sure you aren't being phished"
  },
  "GN2Cu5": {
    "message": "consensus client"
  },
  "GOc7cL": {
    "message": "How badly will I be penalized for being offline?"
  },
  "GTkW7D": {
    "message": "It is not possible to manually request specific amounts of ETH to be withdrawn"
  },
  "GUDhpC": {
    "message": "Section 1"
  },
  "GadkjP": {
    "message": "Documentation on running Lighthouse"
  },
  "Gbo300": {
    "message": "Generate keys"
  },
  "Ge62/G": {
    "message": "Excess balance withdrawals (partial withdrawals)"
  },
  "GelBd9": {
    "message": "Make the file you just downloaded executable."
  },
  "Ght9ln": {
    "message": "Genesis fork version"
  },
  "GlKjxX": {
    "message": "You should see that you have one keystore per validator. This keystore contains your signing key, encrypted with your password."
  },
  "GsBRWL": {
    "message": "Languages"
  },
  "Gsixxx": {
    "message": "Early adoption risks"
  },
  "GuIwY6": {
    "message": "When should I top up my validator’s balance?"
  },
  "H+Wcch": {
    "message": "Section 2"
  },
  "H+kIpp": {
    "message": "Total amount required"
  },
  "H5+NAX": {
    "message": "Balance"
  },
  "H84I+K": {
    "message": "Reth installation documentation"
  },
  "HMgrdg": {
    "message": "Configure your execution client"
  },
  "HXvZ2L": {
    "description": "{http} shows '-rpc-http-enabled' terminal command",
    "message": "Use {http} to connect your consensus node to the JSON RPC endpoint. This will enable the JSON RPC services on the default 8545 port."
  },
  "Hczrvs": {
    "message": "Slashing has two purposes: (1) to make it prohibitively expensive to attack the network, and (2) to stop validators from being lazy by checking that they actually perform their duties. If you're slashed because you've acted in a provably destructive manner, a portion of your stake will be destroyed."
  },
  "HemvTL": {
    "message": "BLS withdrawal credentials ({type0}) can be updated to an execution address ({type1}) by broadcasting a BLS To Execution Change (BTEC) message, signed with your BLS withdrawal key. These messages are included in blocks at a max rate of 16 per block."
  },
  "Hmxd5S": {
    "message": "Please make sure you select {NETWORK_NAME} when prompted for a network, otherwise the deposit will be invalid."
  },
  "HoahTd": {
    "message": "If you do not supply a password, Nimbus will interactively ask for it on startup."
  },
  "HqRNN8": {
    "message": "Support"
  },
  "I0BXSi": {
    "message": "Configure Geth"
  },
  "I212vY": {
    "message": "There is a short wait before your validator becomes active on the Beacon Chain. Use this time to complete the checklist and spend some time validating the {testnet}"
  },
  "I3JhPS": {
    "message": "Network"
  },
  "I3hwdP": {
    "message": "Changing withdrawal credentials"
  },
  "I5lWZA": {
    "message": "Can I change the withdrawal credentials of my validator after the first deposit?"
  },
  "I7MjRD": {
    "message": "Formerly TurboGeth, Erigon is an Ethereum client built to enable performance optimizations."
  },
  "ID3Pgm": {
    "message": "Maximum number of withdrawals that can be processed in a single block"
  },
  "IJw06E": {
    "message": "Sign transaction with your wallet"
  },
  "IWlazt": {
    "message": "full withdrawal"
  },
  "IYvwsI": {
    "message": "Tools available for generating key change message"
  },
  "IZFEUg": {
    "message": "Ready"
  },
  "Icu389": {
    "message": "Understanding validator effective balance"
  },
  "IdUtHu": {
    "message": "Install virtualenv"
  },
  "IhDJWs": {
    "description": "Plural form, for multiple remaining deposits",
    "message": "You have {remainingTxCount} outstanding deposits"
  },
  "IhHhea": {
    "message": "Enter your validator index here to check if you're account is ready for withdrawals or not:"
  },
  "Il9tBQ": {
    "message": "Geth is written in Go, fully open source and licensed under the GNU LGPL v3."
  },
  "InUvmv": {
    "message": "Beacon chain push withdrawals as operations"
  },
  "IwrKbS": {
    "description": "{impact} shows 'impact of effective balance' and links to article on 'Effective Balance'",
    "message": "It depends. In addition to the {impact} there are two important scenarios to be aware of:"
  },
  "J455S4": {
    "message": "If you’re a git user, you can run {gitClone} to download the {master} branch."
  },
  "J5Lzz1": {
    "message": "Chinese (traditional)"
  },
  "J6xb7K": {
    "message": "{wagyuKeyGenGui}: if you provided a withdrawal address when generating your keys, you're good to go"
  },
  "J7T0SR": {
    "message": "Nimbus installation documentation"
  },
  "J9BaKo": {
    "description": "Asks users to check deposit contract address against a block explorer and confirm 32 ETH deposits are present",
    "message": "Are there recent deposits of at least {ethAmount}?"
  },
  "JAiV0o": {
    "message": "In other words, to keep you honest, your actions need to have financial consequences."
  },
  "JMcBLZ": {
    "message": "Outstanding deposits ({remainingTxCount})"
  },
  "JPT/TK": {
    "message": "4. Avoid phishing"
  },
  "Ja5vXW": {
    "message": "Further reading"
  },
  "JhUYU3": {
    "message": "Download CLI app"
  },
  "JqVeL+": {
    "message": "Resource usage can vary significantly between clients. Research the different clients if you're working with resource constraints."
  },
  "Jrg1Me": {
    "message": "Danksharding will change the requirement that full nodes carry the entire history of the chain, and instead will distribute this load amongst the network while still ensuring data availability. This will significantly expand the capacity of layer 1 Ethereum while maintaining the ability to operate a full node on consumer hardware, keeping the network decentralized."
  },
  "Js4uuA": {
    "message": "effective balance"
  },
  "JsTbFu": {
    "message": "Slashed"
  },
  "JtAiN/": {
    "message": "What is your current operating system?"
  },
  "Jvu600": {
    "message": "Your mnemonic"
  },
  "K3uH1C": {
    "message": "offline"
  },
  "K4TRB7": {
    "message": "The number of validators that can be activated or exited in a given epoch (6.4 minutes) is determined by how many active validators are currently on the network."
  },
  "K6+jQ3": {
    "message": "Geth installation documentation"
  },
  "K7xnjy": {
    "description": "Warns users to not run backup validators that have a live copy of their signing keys. Keys should only be on one validator machine at once.",
    "message": "Warning: Do not store keys on multiple (backup) validator clients at once"
  },
  "KBSbmP": {
    "description": "{reloadYourWallet} is a link labeled 'reload your wallet'",
    "message": "You can {reloadYourWallet} to try again, or refresh the page. If issue persists, let us know on {github}."
  },
  "KBjoXt": {
    "message": "Download and uncompress the master branch source code from GitHub."
  },
  "KC9jbz": {
    "message": "Hardware checklist"
  },
  "KEfTSF": {
    "description": "{latestReleased} = 'latest stable software release', being styled in bold",
    "message": "I've installed the {latestRelease} of my consensus client."
  },
  "KJ7R/V": {
    "message": "The Ethereum consensus layer specification"
  },
  "KN7zKn": {
    "message": "Error"
  },
  "KQrlTP": {
    "message": "join"
  },
  "KWWsDo": {
    "description": "{url} is link to GitHub CLI release, made bold for emphasis",
    "message": "Please make sure that you are downloading from the official StakeHouse GitHub account by verifying the url: {url}"
  },
  "KbUOQp": {
    "message": "Nethermind is a robust client built on .NET core designed for performance, versatility and customizability."
  },
  "KhJBVZ": {
    "message": "View the Staking Checklist"
  },
  "KqGKRA": {
    "message": "Once the process is complete, you should see the following:"
  },
  "KvRSg5": {
    "message": "What exactly is slashing?"
  },
  "Kw+pTr": {
    "message": "The python3 install process may differ depending on your linux build."
  },
  "KwfNme": {
    "message": "Configure Besu"
  },
  "KxUgHu": {
    "description": "{boldCaution} is states 'only stored on one validator machine', a bolded caution statement to users",
    "message": "I've ensured my keystore(s) is/are {boldCaution}."
  },
  "L7fPF+": {
    "message": "Complete your last deposit"
  },
  "L7wMQN": {
    "description": "{executionLayerName} is either 'Mainnet' or '<Execution Layer Testnet Name> testnet'",
    "message": "Connect to {executionLayerName}"
  },
  "L8jrV5": {
    "message": "reload your wallet"
  },
  "LHPZ+C": {
    "message": "Lighthouse is a consensus client implementation, written in Rust with a heavy focus on speed and security."
  },
  "LVy+cS": {
    "message": "Check with client documentation to ensure the hardware you want to use is sufficient and supported."
  },
  "LWIlKS": {
    "message": "You can also confirm the deposits individually below..."
  },
  "LeHQQm": {
    "message": "Validator FAQs"
  },
  "Ljo9dF": {
    "message": "Bulgarian"
  },
  "LlClXS": {
    "message": "Thank you for supporting the Ethereum network!"
  },
  "LpnfTF": {
    "message": "Lodestar installation documentation"
  },
  "Ltd/hJ": {
    "description": "{directoriesPattern} refers to a computer command which will find {keyDirectory} and\n                {passwordDirectory} - both folders within a computer.",
    "message": "{directoriesPattern} will find {keyDirectory}, and expect to find {passwordDirectory}."
  },
  "Lv3Pmp": {
    "message": "Your initial deposit has already been made for this validator public key. Please wait and check the status of your deposit on the Beaconchain data provider."
  },
  "Lv57+8": {
    "message": "Ethereum is secured by proof-of-stake, although this was not always the case. The Beacon Chain was the first step to establishing a PoS consensus layer on Ethereum, launching in parallel to Mainnet in December 2020. This allowed participants to start staking their ETH and prepare the network for the formal transition from proof-of-work to proof-of-stake via The Merge."
  },
  "LwEHRm": {
    "message": "Why do I need to run an execution client now?"
  },
  "M35Dz/": {
    "message": "Upload to Beacon Node BLSToExecutionChange pool"
  },
  "M3GwXS": {
    "message": "You'll only get your full rewards if your validator is online and up to date. This is your responsibility. If your validator goes offline you'll be penalized. The penalties for being offline are roughly equal to the rewards for actively participating."
  },
  "MAVs3a": {
    "message": "*Simply being offline with an otherwise healthy network does not result in slashing, but will result in small inactivity penalties."
  },
  "MCmGYv": {
    "message": "Copied ✓"
  },
  "MIsmjW": {
    "message": "Connect new wallet"
  },
  "MQTBvH": {
    "message": "Protect yourself against double deposits"
  },
  "MSanFQ": {
    "message": "books"
  },
  "MX00UO": {
    "message": "What happens if my withdrawal key is stolen?"
  },
  "MZvoWG": {
    "message": "The upgrades"
  },
  "MZzOnU": {
    "message": "How is Ethereum scaling?"
  },
  "MaZo9k": {
    "message": "Wagyu Key Gen GUI"
  },
  "MalGck": {
    "message": "Geth on Holesky documentation"
  },
  "Mb3npQ": {
    "message": "Using the terminal"
  },
  "MbLMTq": {
    "message": "This can be summarized to estimate the upper limit of how long a complete sweep takes depending on how many withdrawals need processing:"
  },
  "MbsAo3": {
    "message": "This launchpad will help you become a validator, so you can play an active part in Ethereum's future. Validators are key to the more secure, scalable, and sustainable Ethereum we're building together."
  },
  "Mc8nNE": {
    "message": "Transaction failed"
  },
  "Mlc7Vr": {
    "message": "The Ethereum upgrades will only be successful if validators understand the risks and responsibilities."
  },
  "MmZjeu": {
    "message": "Top-up details"
  },
  "Mne5iM": {
    "message": "If so, stop. {fullWithdrawal} processed for any remaining balance"
  },
  "Mor0Ih": {
    "message": "Bad validator behavior"
  },
  "N0rwnt": {
    "message": "{depositFileName} isn't a valid deposit_data JSON file. Try again."
  },
  "N6QzJ5": {
    "message": "a few more days"
  },
  "NDrMCw": {
    "message": "Total number of validator accounts that have eligible withdrawals (variable)"
  },
  "NEmnAV": {
    "message": "Italian"
  },
  "NLgogh": {
    "message": "Launchpad network:"
  },
  "NOTCV0": {
    "message": "Prometheus and Grafana monitor"
  },
  "NPmm0q": {
    "message": "You must be on a desktop device to use this app."
  },
  "NSK+Li": {
    "message": "I've secured the root account."
  },
  "NTWnJC": {
    "message": "Download command line app"
  },
  "NTdFPX": {
    "message": "Rewards and penalties are issued every 6.4 minutes—a period of time known as an epoch."
  },
  "NUCB4G": {
    "message": "This {network} validator needs to be configured for withdrawals. Take note of your withdrawal credentials as you'll need this to update your keys."
  },
  "NVljH4": {
    "message": "More on Prysmatic Labs"
  },
  "NYFKzu": {
    "message": "Staking checklist"
  },
  "NZIM+F": {
    "message": "Send remaining {remainingTxCount} deposits"
  },
  "NZYRdf": {
    "message": "Mainnet"
  },
  "NatYUJ": {
    "message": "Learn more about the roles and responsibilities of Ethereum validators."
  },
  "Nb5DNK": {
    "message": "Become a validator with Teku"
  },
  "NiWtxk": {
    "message": "{type1} = \"Type 1\" = Execution keys = New withdrawal credentials: {withdrawalsEnabled}"
  },
  "NkFxlX": {
    "message": "At least {time} (four epochs) from the current epoch before reaching the exit epoch (with no others in the queue, {highlyVariable})"
  },
  "NwzcYT": {
    "message": "Teku needs to be pointed at files containing keystores and their associated passwords at startup. There are 3 methods for doing so."
  },
  "O+3LJ1": {
    "message": "This validator's balance is at the effective maximum: {PRICE_PER_VALIDATOR} {TICKER_NAME}."
  },
  "O3qkOm": {
    "message": "Sharding"
  },
  "O4kYrf": {
    "message": "Total number of validator accounts (index count, every validator account ever registered, up-only over time)"
  },
  "OBmVqN": {
    "message": "Hyperledger Besu is an open-source Ethereum client developed under the Apache 2.0 license and written in Java."
  },
  "OCl7KQ": {
    "message": "Like all Ethereum transactions, deposits are non-reversible, but the ability to withdrawal your funds via a separate process after depositing remains under your control."
  },
  "OIvXIO": {
    "message": "Complete remaining {remainingTxCount} deposits"
  },
  "OJOu1W": {
    "message": "Documentation on running Erigon"
  },
  "ON2tXT": {
    "message": "The Nethermind documentation explains how to download and install the client."
  },
  "ORVjVH": {
    "message": "Then another {time} (256 epochs) before those funds are flagged as withdrawable"
  },
  "OSEFbC": {
    "message": "Immediately upon broadcasting a signed voluntary exit message, the {exitEpoch} and {withdrawableEpoch} values are calculated based off the current epoch number. These values determine exactly when the validator will no longer be required to be online performing validation, and when the validator is eligible for a full withdrawal respectively."
  },
  "OdYQYh": {
    "message": "More on ConsenSys"
  },
  "OmAmmi": {
    "message": "More on the Merge"
  },
  "OsO8ik": {
    "message": "I am technically capable of setting up and running a validator."
  },
  "Ou/o3H": {
    "message": "Everything you should understand before becoming a validator."
  },
  "Ox4e26": {
    "message": "Similarly, there is also an {exitQueue}, which limits how quickly validators can {leave} the network. This is for security reasons. Given each validator is limited to a max effective balance of {PRICE_PER_VALIDATOR} {TICKER_NAME}, this prevents large portions of the ETH from potentially being used in an attack and then quickly exiting from the network all at once."
  },
  "P+nziG": {
    "message": "As a validator, you'll need to have funds at stake so you can be penalized for behaving dishonestly."
  },
  "P/Oh91": {
    "message": "Phishing is a very real risk for Ethereum validators and, unfortunately, many people will lose funds due to these attacks."
  },
  "P1QerV": {
    "description": "{discord} and {reddit} are links to EthStaker forums on Discord and Reddit respectively",
    "message": "If you have questions, EthStaker community is a good place to get help! You can find support on {discord} or {reddit}."
  },
  "P8FrVE": {
    "message": "JWT Authentication"
  },
  "P91KmA": {
    "message": "Become a validator {emoji}"
  },
  "P9mVZK": {
    "message": "Your network has changed"
  },
  "PHZO0L": {
    "message": "Launchpad walkthrough tutorial"
  },
  "PQgBnI": {
    "message": "This epoch is determined by the first available epoch that isn't already maxed out with other validators exiting (rate limit depends on total validators on the network), and must be at least four (4) epochs after the exit was initiated."
  },
  "PfoT0C": {
    "message": "This checklist will help you understand the role of a validator and prepare you for the role."
  },
  "PglO1W": {
    "message": "Formal verification report"
  },
  "PoBIK+": {
    "message": "You'll need SSD storage to consistently handle necessary read/write speeds."
  },
  "Pswssl": {
    "message": "Confirmation"
  },
  "PurNgG": {
    "message": "Turkish"
  },
  "Px7wWb": {
    "message": "pip documentation"
  },
  "Q/HeiY": {
    "message": "Beaconcha.in Broadcast Tool"
  },
  "Q1ZwPT": {
    "message": "clipboard"
  },
  "Q6N+C6": {
    "message": "Ethereum had its genesis on July 30, 2015. It is growing in size over time, and the introduction of Danksharding will also increase storage, memory, and bandwidth requirements."
  },
  "Q8P0rZ": {
    "message": "Validators have a maximum effective balance of {PRICE_PER_VALIDATOR} {TICKER_NAME}. You only need to top up {maxTopupValue} {TICKER_NAME} to max out your effective balance."
  },
  "QKFeMq": {
    "message": "Internet"
  },
  "QOAgQF": {
    "message": "Note: by default, VMs may disable NTP so you may need to find a work-around for your environment."
  },
  "QRUdO6": {
    "message": "Set fee recipient"
  },
  "QRwpD3": {
    "message": "Learn about ports in networking"
  },
  "QWDxrk": {
    "message": "Key management"
  },
  "QcnkjI": {
    "message": "If your validator account still has BLS withdrawal credentials ({type0}), a one-time message must be broadcast signaling which execution layer account should be used for all withdrawals."
  },
  "QeE86m": {
    "message": "Check this document to learn how to run a node on {networkName}"
  },
  "QlsDcr": {
    "message": "Action"
  },
  "Qo9UHj": {
    "message": "More on staking withdrawals"
  },
  "QqqeNk": {
    "message": "Transaction rejected"
  },
  "Qs/oj3": {
    "message": "You may have an {TICKER_NAME} deposit that was accepted but is being validated on chain. It will be available here when beaconcha.in has confirmed 2048 blocks."
  },
  "R7v7y3": {
    "message": "Set withdrawal address"
  },
  "R8eePn": {
    "message": "If you're slashed you're prevented from participating in the protocol further and are forcibly exited."
  },
  "RCGrka": {
    "message": "only way"
  },
  "RE2MaJ": {
    "message": "Consensus clients"
  },
  "RGD1CX": {
    "message": "Four (4) validator exits are allowed per epoch, plus one (1) more for every 65,536 total active validators over 327,680. As of April 2023 this limit is eight (8), and will increase to nine (9) if/when the active validator count reaches 655,360."
  },
  "ROHpFF": {
    "message": "1. Learn about your responsibilities"
  },
  "ROwygg": {
    "message": "EIP-4895"
  },
  "RVyb7r": {
    "message": "Can I stop running my validator for a few days and then start it back up again?"
  },
  "RWqrlk": {
    "message": "congratulations"
  },
  "RY4SP0": {
    "message": "I understand that I need to deposit {PRICE_PER_VALIDATOR} {TICKER_NAME} onto the Beacon Chain to become a validator. Withdrawing deposited {TICKER_NAME} from the Beacon Chain is accomplished via a separate process."
  },
  "RdHdwG": {
    "message": "Instructions on how to use the staking-deposit-cli tool to generate and broadcast a SignedBLSToExecutionChange message to update validator withdrawal credentials."
  },
  "Rg5ySE": {
    "message": "How many validators would you like to run?"
  },
  "RqcJGJ": {
    "description": "Link to documentation about execution client Besu, specifically for Holesky testnet",
    "message": "Besu on Holesky documentation"
  },
  "Rr2lI/": {
    "message": "You are responsible for this transaction!"
  },
  "RrCui3": {
    "message": "Summary"
  },
  "Ryptmy": {
    "message": "Verify it with the following command to check if it returns the client version correctly:"
  },
  "S+FY5u": {
    "message": "This requires use of your mnemonic seed phrase, and should be performed on an {offline} air-gapped machine."
  },
  "S943uU": {
    "message": "Double check the URL"
  },
  "SB6yx7": {
    "message": "The Teku config file environment variable"
  },
  "SGzXoY": {
    "message": "Your stake has reached the deposit contract!"
  },
  "SHNw06": {
    "message": "Execute the file you just downloaded."
  },
  "SVUntz": {
    "message": "Note that once a user has {type1} withdrawal credentials and has broadcast a voluntary exit, there is no further action required until the processing is complete."
  },
  "SaR1pU": {
    "message": "Deposit already exists"
  },
  "Sd+Pq6": {
    "message": "Total validators"
  },
  "Sd0I/u": {
    "message": "Validator public key"
  },
  "Sd3VAH": {
    "message": "Validators that have exited or been slashed are not eligible for topping up"
  },
  "Sd9qhL": {
    "message": "More on slashing risks"
  },
  "SdRBir": {
    "message": "To become a validator, you will need to be able to run commands in the terminal on your computer. Generating your new key pairs and installing the validator software are both done in the terminal."
  },
  "SeW5ak": {
    "message": "Verify the contract address in your wallet before you sign."
  },
  "Seanpx": {
    "message": "Required"
  },
  "SqKNq2": {
    "description": "{homebrew} = 'homebrew' and links to the homebrew package manager website documentation",
    "message": "You can install python3 on your macOS device using {homebrew}"
  },
  "Su0UFr": {
    "message": "Exit queue summary"
  },
  "Sv30z9": {
    "message": "If you’re preparing to make a deposit to activate a new validator, you can (and should) provide a withdrawal address with your initial deposit. This is done at time of key generation, and is then included in your deposit data json file {depositData} which is submitted with your 32 ETH deposit transaction."
  },
  "Sy5bAo": {
    "message": "With the transition to proof-of-stake complete via The Merge, validators are now responsible for processing transactions and signing off on their validity. This data is {not} available from popular third-party sources as of The Merge. Using a third-party provider will result in your validator being offline. When Danksharding is implemented, validators may also be at risk of slashing under the {pocGame}."
  },
  "Szwbym": {
    "message": "wrench"
  },
  "T2O2Gr": {
    "message": "initial and maximum"
  },
  "THIzw6": {
    "message": "Validators and Ethereum"
  },
  "TKCr16": {
    "message": "This full withdraw of funds requires that a withdrawal address be set, and will be automatically transferred in the next validator sweep."
  },
  "TMw9oz": {
    "message": "Visit this site on desktop to become a validator."
  },
  "TZtYuA": {
    "message": "The terms 'Eth1' and 'Eth2' have been deprecated with The Merge. Since successfully transitioning to proof-of-stake via The Merge, there are no longer two distinct Ethereum networks; there is only Ethereum."
  },
  "TfNuWP": {
    "message": "virtualenv would help you to create an isolated Python environment for deposit-cli tool."
  },
  "Tpe6yK": {
    "message": "rpc-http-enabled documentation"
  },
  "U/NPbq": {
    "message": "German"
  },
  "U0yY/A": {
    "message": "View extensive client comparison"
  },
  "U7AOxj": {
    "message": "greater than 50%"
  },
  "UJMct0": {
    "description": "{etherscan} is a share link to this transaction on etherscan.io, labeled 'Etherscan'",
    "message": "Check {etherscan} for more details"
  },
  "UWv7yD": {
    "message": "Check the deposit contract on your favorite Ethereum block explorer:"
  },
  "UYRyWv": {
    "message": "Mechanics of withdrawals: How they work"
  },
  "UYoRgC": {
    "message": "Depending how you set up your initial deposit, your account may or may not be ready for withdrawals already:"
  },
  "UZkvC5": {
    "message": "Up until this epoch (while \"in the queue\") your validator is expected to be online and is held to the same slashing rules as always."
  },
  "UdDXU6": {
    "message": "immediately"
  },
  "Utck3E": {
    "message": "Language support"
  },
  "Uxs0RD": {
    "message": "Graffiti"
  },
  "Uy8THS": {
    "description": "{strongText} shows 'This scenario is very extreme and unlikely to happen' and is bolded for emphasis",
    "message": "Being offline at the same time as more than 1/3 of the total number of validators leads to harsher penalties, since blocks do not finalize anymore. {strongText}"
  },
  "UygdAl": {
    "message": "One of the three original implementations of the Ethereum protocol."
  },
  "UykRIk": {
    "message": "Becoming a validator is a big responsibility with important preparation steps. Only start the deposit process when you're ready."
  },
  "V+P6OJ": {
    "message": "This became a requirement at time of The Merge, so be sure you're running both before staking."
  },
  "V1iY4C": {
    "message": "Reth is built in Rust, a language empowering everyone to build reliable and efficient software. Rust is a general-purpose programming language that emphasizes performance, type safety, and concurrency. It enforces memory safety—meaning that all references point to valid memory—without a garbage collector."
  },
  "VASo1/": {
    "message": "Connect wallet"
  },
  "VEj6nh": {
    "message": "Nethermind installation documentation"
  },
  "VIMMdE": {
    "message": "Do not submit any transaction with a {depositData} file that you did not create yourself, or that you do not own the mnemonic phrase for."
  },
  "VKfWR3": {
    "message": "Recommended"
  },
  "VLDKor": {
    "message": "{PRICE_PER_VALIDATOR} {TICKER_NAME} is the maximum effective validator balance. This means you won't earn more rewards if your validator's balance goes above {PRICE_PER_VALIDATOR}. However you will earn less if it dips below {PRICE_PER_VALIDATOR}."
  },
  "VSSmNp": {
    "message": "In other words: if the total amount of ETH staked is low, the reward (interest rate) is high, but as the total stake rises, the reward (interest) paid out to each validator starts to fall."
  },
  "VUuZsb": {
    "message": "martial arts uniform"
  },
  "Vbv7Uw": {
    "message": "We'll help you create a signing key for every validator you want to run. You may choose to provide a withdrawal address for your validator when generating your deposit data, which will permanently set the withdrawal address. This is recommended for most users."
  },
  "VctWDX": {
    "message": "I am certain that the validator I am topping up is my validator."
  },
  "Vm6cRY": {
    "message": "This communication is secured using a {jwt} secret, which is a secret key that is shared only between the two clients to authenticate one another. This shared JWT secret must be made available to each client (both execution and consensus clients) to allow them to communicate with one another properly."
  },
  "VzGJkB": {
    "message": "Staker checklist"
  },
  "W10U1b": {
    "message": "Teku is Apache 2 licensed and written in Java, a language notable for its maturity and ubiquity."
  },
  "W1mus6": {
    "message": "Once a signed voluntary exit message is broadcast, it takes:"
  },
  "W2Eues": {
    "message": "Warning: This is a staking launchpad for the {testnet}."
  },
  "W3t7Ob": {
    "message": "Japanese"
  },
  "W8nHSd": {
    "message": "FAQ"
  },
  "WFVzvu": {
    "message": "{warning} Duplicate deposits with the same keyfile public key will be considered as a double deposit. Any extra balance more than {eth} will NOT be counted in your effective balance on the Beacon Chain. You also won't be able to withdraw it until the Beacon Chain merges with mainnet."
  },
  "WJA1/H": {
    "message": "Remember"
  },
  "WMLn/w": {
    "message": "{totalTxCount} validators"
  },
  "WTPUDZ": {
    "message": "These steps are optional but are recommended to optimize your node."
  },
  "WVsePo": {
    "message": "Reth is a modular, contributor-friendly and blazing-fast implementation of the Ethereum protocol, in Rust. Reth is able to sync an archive node in less than 50 hours from genesis. A Reth mainnet archive node is only 2.1TB in June 2024."
  },
  "WYlfSC": {
    "description": "Links to the documentation for the execution client Nethermind, specifically for testnet Holesky",
    "message": "Nethermind on Holesky documentation"
  },
  "WdDGn6": {
    "message": "An implementation of the consensus protocol with a focus on usability, security, and reliability. Prysm is developed by Prysmatic Labs, a company with the sole focus on the development of their client."
  },
  "WkrNSk": {
    "message": "English"
  },
  "Wl6cI3": {
    "message": "Please accept the conditions above."
  },
  "Wxzght": {
    "message": "Drag file to upload or browse"
  },
  "X/fKmY": {
    "message": "Has the block explorer named the contract?"
  },
  "X3NiFM": {
    "message": "proof-of-custody game"
  },
  "X4qc7f": {
    "message": "timestamp"
  },
  "X5KFEh": {
    "message": "That is not a valid deposit_data JSON file."
  },
  "X6/BRy": {
    "message": "You can find the {file} file in the {folder} folder by default."
  },
  "X72hpo": {
    "message": "This validator is ready to start receiving rewards to the withdrawal address below. No further action is needed."
  },
  "XBEBYR": {
    "message": "More on installing pip"
  },
  "XLXSsV": {
    "message": "Reth provides an active Telegram chat for technical discussion and troubleshooting."
  },
  "XRUCUL": {
    "message": "Once an execution address has been provided by signing the BLS To Execution Change message, the withdrawal keys derived from your validator mnemonic are no longer utilized. Therefore, providing an execution address that you control as early as possible is the recommended option for most users, and is the default path for those who join via this site's onboarding process. This protects you against permanent loss of all funds in the event you are unable to recover your mnemonic and withdrawal keys."
  },
  "XVRQoq": {
    "message": "Since the Merge, third-party providers (such as Infura and Alchemy) are no longer viable options to outsource execution layer responsibilities. All stakers must run both an execution and a consensus client to properly attest to the network."
  },
  "XVehvN": {
    "description": "{filesPattern} refers to a computer command which will find {keyFile} and\n                {passwordFile} - both files within a computer.",
    "message": "{filesPattern} will expect that the {keyFile} exists, and the file containing the password for it is {passwordFile}."
  },
  "Xbt2gv": {
    "description": "{http} shows '--http' terminal command",
    "message": "Use {http} to connect your consensus node to the JSON RPC endpoint. This will enable the JSON RPC services on the default 8545 port."
  },
  "XcItS7": {
    "message": "~25 minutes"
  },
  "XmddSV": {
    "message": "Build from source"
  },
  "XsZtDM": {
    "message": "Capella - Formal specification"
  },
  "XszRWL": {
    "description": "this is used as a command line flag",
    "message": "eth1_withdrawal_address"
  },
  "Y07Hwy": {
    "message": "Connect {wallet} to {executionLayerName}"
  },
  "Y47aYU": {
    "message": "Top up"
  },
  "Y9S0NE": {
    "message": "Send last deposit"
  },
  "YBs4dR": {
    "message": "The latest version of pip should have been installed with python 3.x.x. For more information about installing pip on Windows, visit {windowsInstallGuide}. Or you can install the pip package via {chocolatey}."
  },
  "YFFqcn": {
    "message": "I understand proof-of-stake and why validators are needed."
  },
  "YFT4rG": {
    "message": "Keys"
  },
  "YJI2xv": {
    "message": "A decision tree is followed to determine what type of withdrawal will be initiated. If the validator being checked has ETH that is eligible to be withdrawn, it is added to the withdrawal queue. If there isn’t, the account is skipped."
  },
  "YP03/j": {
    "message": "Afterwards, validators are still encouraged to join (the more validators the more decentralized the network), but it’s not absolutely essential that they do so (so the interest rate can fall)."
  },
  "YPsbIU": {
    "description": "{grafana} is 'Grafana' service, with link to its homepage (do not translate name)",
    "message": "I've set up my {grafana} service."
  },
  "YQJy4H": {
    "message": "You should now have your mnemonic written down in a safe place and a keystore saved for each of your {validatorCount} validators. Please make sure you keep these safe, preferably offline. Your validator keystores should be available in the selected directory."
  },
  "YXrp+b": {
    "message": "{wagyuKeyGenGui}: This software is being updated to require users to provide a withdrawal address during key generation. In the meantime, you may have to check “Advanced” during setup to enter a withdrawal address."
  },
  "YZtVDX": {
    "message": "Oops! Double check validator index number and try again."
  },
  "Yd6MEN": {
    "message": "Execution clients"
  },
  "YeJh+/": {
    "message": "By completing step one, you’ll enable withdrawals from your validator account. This will automatically trigger excess balance payments (partial withdrawals) to be processed, but this does not automatically unlock the rest of your funds, or trigger an exit from the network."
  },
  "Yg8vug": {
    "message": "Make sure you’ve updated your withdrawal credentials with an execution withdrawal address"
  },
  "Yganfl": {
    "message": "Type the following lines into the terminal window:"
  },
  "Yo9B64": {
    "message": "execution layer (Eth1) address"
  },
  "YqsgWz": {
    "message": "Slovenian"
  },
  "YtwQyB": {
    "description": "{changeYourWallet} is a link labeled 'change your wallet'",
    "message": "You can {changeYourWallet} to load validators for a different address."
  },
  "Yu78N6": {
    "message": "money bag"
  },
  "Z07LQm": {
    "message": "Couldn't upload {depositFileName} due to an error. Open an issue in GitHub so we can investigate."
  },
  "Z1aGQe": {
    "description": "{greater than 50%} shows 'greater than 50%' and is a link to validator incentives article",
    "message": "Overall, we'd expect your validator to be net profitable as long as your uptime is {greaterThan50Percent}."
  },
  "ZK6NmY": {
    "message": "Note: the RTC (Real-Time Clock) time may be set to your local timezone instead of UTC, especially in a VM which has its clock configured on Windows."
  },
  "ZOU+p7": {
    "message": "--http documentation"
  },
  "ZOXuIe": {
    "message": "Why do I need to have funds at stake?"
  },
  "ZQo9kO": {
    "description": "A minipool is a Rocket Pool-specific term for a validator that shares stake with others",
    "message": "Exiting a {software} minipool"
  },
  "ZTo0Fl": {
    "message": "Why is there a wait?"
  },
  "ZsXdlw": {
    "message": "Erigon installation documentation"
  },
  "Zspg8H": {
    "message": "Section 1 - Before you start"
  },
  "ZtpRuA": {
    "message": "Install and set virtualenv:"
  },
  "ZwqwuN": {
    "message": "Rewards are given for actions that help the network reach consensus"
  },
  "ZzTcj5": {
    "message": "Download python3 and follow the installation instructions."
  },
  "a+xjjV": {
    "message": "Become a validator with Prysm"
  },
  "a/140i": {
    "message": "Exit queue and activation queue"
  },
  "a9e29d": {
    "message": "store your mnemonic safely"
  },
  "aEBE6s": {
    "message": "2. Prep nodes"
  },
  "aR50Oc": {
    "message": "To exit staking and fully withdrawal your entire remaining balance, you must do two things:"
  },
  "aS6dBe": {
    "message": "Configure Nimbus"
  },
  "aXT3iO": {
    "message": "Nimbus is Apache 2 licensed and written in Nim, a language with Python-like syntax that compiles to C."
  },
  "acrOoz": {
    "message": "Continue"
  },
  "aozN2h": {
    "message": "See your consensus client documentation for client-specific instructions on how to set this."
  },
  "azLmaD": {
    "message": "Build deposit-cli from the Python source code"
  },
  "b3J7Pw": {
    "message": "No. There is no advantage to having more than {pricePerValidator} ETH staked."
  },
  "b8APBK": {
    "message": "More on client diversity"
  },
  "bFiejS": {
    "message": "Note that in the second (unlikely) scenario, you stand to progressively lose up to 50% ({EJECTION_PRICE} ETH) of your stake over 21 days. After 21 days you are ejected out of the validator set. This ensures that blocks start finalizing again at some point."
  },
  "bNFkSo": {
    "message": "Now follow the instructions presented to you in the terminal window to generate your keys."
  },
  "bR1R2M": {
    "message": "Use this as a reference during client setup to check off important steps."
  },
  "bUk/lm": {
    "message": "Besu installation documentation"
  },
  "bUn2/Z": {
    "message": "Download Wagyu Key Gen app"
  },
  "bVtlF7": {
    "message": "Be sure to account for enough space on your drive until you run maintenance on your node."
  },
  "bagKCF": {
    "message": "If you've already provided an Ethereum withdrawal address for your withdrawal credentials, your entire remaining balance will be transferred to this address upon exit. If not, your mnemonic will still be needed to generate your withdrawal key to set your withdrawal address."
  },
  "bbr+aD": {
    "message": "The YAML files can have different syntaxes."
  },
  "be6WvD": {
    "message": "A {nodeOperator} is the human being who makes sure the client software is running appropriately, maintaining hardware as needed."
  },
  "bembWf": {
    "message": "Withdrawals not enabled"
  },
  "bgyJfz": {
    "message": "What clients do I need to run?"
  },
  "bhFma7": {
    "message": "More on withdrawals"
  },
  "bnuvhg": {
    "message": "Lighthouse is built in Rust and offered under an Apache 2.0 License."
  },
  "bugMfW": {
    "message": "If not, move to next question"
  },
  "bxU6sX": {
    "message": "Python installation instructions"
  },
  "by+LIm": {
    "message": "What is a validator client?"
  },
  "cD0jre": {
    "message": "Do not deposit more than {PRICE_PER_VALIDATOR} ETH for a single validator—it will not add to your rewards."
  },
  "cE71F9": {
    "message": "[Example: {fork}]"
  },
  "cHUoV9": {
    "message": "The Geth documentation explains how to download and install the client."
  },
  "cJ9MRI": {
    "message": "If more than 16 requests are being made at one time, a queue will be formed and these will be processed in subsequent blocks. Once completed, your validator is permanently enabled for withdrawals, and will be eligible for payouts during the next sweep."
  },
  "cJX99/": {
    "message": "Check your favorite Beacon Chain block explorer:"
  },
  "cPsIkp": {
    "message": "Become a validator and help secure the future of Ethereum."
  },
  "cRzxes": {
    "message": "Current APR"
  },
  "cU/ZP6": {
    "message": "Ethereum uses proof-of-stake to reach consensus."
  },
  "cav520": {
    "message": "Download from GitHub"
  },
  "ccU6l/": {
    "message": "Online"
  },
  "cdkI09": {
    "message": "How each validator is evaluated for withdrawals"
  },
  "chsS1X": {
    "message": "If not, stop. No withdrawal will be processed and account skipped"
  },
  "chw27s": {
    "message": "More on PegaSys Teku"
  },
  "clUb0+": {
    "message": "Command Line"
  },
  "clxIWO": {
    "message": "How much will I be penalized for acting maliciously?"
  },
  "cnQKC2": {
    "message": "Currently Geth is used by >66% of the network."
  },
  "cpxfOR": {
    "message": "What are withdrawal credentials?"
  },
  "cyR7Kh": {
    "message": "Back"
  },
  "d4g3yx": {
    "message": "Step 2: Generate deposit keys using the Wagyu Key Gen app"
  },
  "d5KEM8": {
    "message": "You must sign a transaction for every deposit you want to make."
  },
  "dIgBOz": {
    "message": "Deposit"
  },
  "dJMce5": {
    "message": "Prysm is a Go consensus client implementation of the Ethereum protocol with a focus on usability, security, and reliability."
  },
  "dLE9FH": {
    "message": "If not, no withdrawal will be processed and account skipped"
  },
  "dM/KIM": {
    "message": "What exactly is a validator?"
  },
  "dTOtPO": {
    "message": "Top Up"
  },
  "dVJcJt": {
    "message": "{stakingDepositCli}: This is done by using the “eth1 withdrawal address” ({eth1WithdrawalAddress}) flag when generating your keys with the Staking Deposit CLI."
  },
  "deLJOg": {
    "message": "Upload a valid json file."
  },
  "dprf8W": {
    "message": "Where can I find troubleshooting support?"
  },
  "dvr19k": {
    "message": "Setup"
  },
  "dwahMV": {
    "message": "You may choose to provide a withdrawal address with your initial deposit to automatically enable reward payments and also the ability to fully exit your funds at anytime (recommended). This address should be to a regular Ethereum address and will be the only address funds can be sent to from your new validator accounts, and cannot be changed once chosen."
  },
  "dzdAcD": {
    "message": "Default Port"
  },
  "e+9dMk": {
    "message": "Execution JWT docs:"
  },
  "e/PSgJ": {
    "message": "Upload deposit data"
  },
  "e4f94H": {
    "description": "{code} values are terminal outputs and commands.",
    "message": "If {code1} is not {code2}, run: {code3}"
  },
  "eKEL/g": {
    "message": "Pending"
  },
  "eOVXJz": {
    "message": "Submit a transaction to finish your deposit."
  },
  "eOpZjd": {
    "message": "It specifies who is staking, who is validating, how much is being staked, and who can withdraw the funds."
  },
  "eTenzU": {
    "message": "activation queue"
  },
  "eX072N": {
    "message": "Erigon is an execution client on the efficiency frontier, written in Go."
  },
  "eaU/aL": {
    "message": "To maximize security and efficiency of your node, use dedicated hardware to run your clients. This reduces risk of malware exposure and minimizes competition for computing resources, ensuring your node handles the network load and its validator responsibilities at all times."
  },
  "eq0/34": {
    "message": "The Merge"
  },
  "erZJkZ": {
    "message": "When launching Teku, keystores and passwords can be provided in different ways."
  },
  "esDvdR": {
    "message": "Validator balance is over {PRICE_PER_VALIDATOR}, but effective balance is low ({effectiveBalance}). Adding {minTopupValue} {TICKER_NAME} (the minimum allowed by the deposit contract) will max out your effective balance."
  },
  "eyK2E3": {
    "message": "Complete checklist"
  },
  "f/N7FO": {
    "message": "What happens if I lose my signing key?"
  },
  "fBCdim": {
    "message": "Previously a Beacon Node (consensus layer) only had to watch the staking deposit contract on the execution layer in order to know which validator accounts had deposited {pricePerValidator} ETH. This information was easily served by and obtained from third-party providers such as Infura or Alchemy."
  },
  "fHLKXR": {
    "message": "The answer to this question very much depends on how much ETH you have at your disposal."
  },
  "fQ5yno": {
    "message": "Arabic"
  },
  "fR8+bQ": {
    "message": "During setup"
  },
  "fRCqob": {
    "message": "Accounts that have fully withdrawn and have a zero balance will be skipped"
  },
  "fSi2R/": {
    "message": "Information for validator operators regarding staking withdrawals."
  },
  "fZwn+P": {
    "message": "After client installation, ensure you are fully synced before submitting your staking deposit. This can take several days."
  },
  "fbiteI": {
    "message": "only stored on one validator machine"
  },
  "fnMHGO": {
    "message": "Waiting for wallet confirmation"
  },
  "fpe4Gx": {
    "message": "Active accounts with an effective balance or total balance less than {PRICE_PER_VALIDATOR} {TICKER_NAME} will be skipped"
  },
  "frGVRP": {
    "message": "impact of effective balance"
  },
  "frIMm4": {
    "message": "Syncing your execution client may take a few days in the worst-case scenario."
  },
  "fzrOtJ": {
    "message": "Consensus layer slot timing: 12 seconds (no plans to change)"
  },
  "g/DxI7": {
    "message": "Moreover, you can set your Validator Client (VC) and Beacon Node (BN) on separate machines and IPs so that even if your beacon node is vulnerable, your keystore is stored on a different machine."
  },
  "g37XKP": {
    "message": "More on virtualenv"
  },
  "g8tzOu": {
    "message": "Paste your chosen address here to include it in the copy/paste CLI command below:"
  },
  "gFj3By": {
    "message": "highly variable"
  },
  "gHJegi": {
    "message": "Validators still need to complete their validation duties until they are exited"
  },
  "gQkd2y": {
    "message": "Generate deposit keys using the Ethereum Foundation deposit tool"
  },
  "gVC0Wl": {
    "message": "It uses the assisted password in your secrets folder."
  },
  "gWC0Rt": {
    "message": "Like a clock hand, this process progresses in one direction, and when the last validator is reached, the sweep starts over again from the beginning. At each validator along the way, the account is evaluated for potential withdrawals."
  },
  "gXVf9n": {
    "message": "Latest Reth Benchmarks"
  },
  "gfLdAQ": {
    "message": "More on the Beacon Chain"
  },
  "gjBiyj": {
    "message": "Loading..."
  },
  "gjmx29": {
    "message": "YES"
  },
  "grF2gm": {
    "message": "Each key-pair associated with a validator requires locking {ethPerValidator} to be activated, which represents your initial balance as well as your {initialAndMaximum} voting power for any validator."
  },
  "gsuLMm": {
    "message": "Greek"
  },
  "gtrcyK": {
    "description": "{code} values are terminal outputs to look for to confirm system time",
    "message": "Check if {code1}, {code2}, and {code3} are all correct."
  },
  "guMfKn": {
    "message": "This means that you don't need to go to extreme lengths with backup clients or redundant internet connections as the repercussions of being offline are not so severe."
  },
  "gx6frf": {
    "message": "clock"
  },
  "gzXQDW": {
    "message": "Withdrawable epoch"
  },
  "h/n5+N": {
    "message": "As a staker you are required to maintain and operate a node, running BOTH a consensus client AND an execution client."
  },
  "h8MTUo": {
    "message": "Your stake"
  },
  "hAwuqj": {
    "message": "Validating involves two keys for security reasons. Your signing key must be available at all times. As such, it will need to be held online. Since anything online is vulnerable to being exposed, it’s not a good idea to use the same key for withdrawals."
  },
  "hBIbQ+": {
    "message": "Avoid overly-complicated setups and be aware of trade offs. Being offline for brief periods of time will result in small inactivity penalities, but will be recouped easily after being online again for about the same amount of time. Complicated power backups can add to the expense of your setup, and redundant backup validators can lead to a more serious penalty known as slashing."
  },
  "hCwX6+": {
    "message": "BLS To Execution Change (BTEC) queue"
  },
  "hG0uP4": {
    "message": "Desktop only"
  },
  "hPCn9f": {
    "message": "--JsonRpc.Enabled documentation"
  },
  "hXE+0W": {
    "description": "Tells user to upload specific JSON file created during previous step",
    "message": "Upload {depositJSON}"
  },
  "hZrkPB": {
    "message": "In other words, you maximize your rewards by providing the greatest benefit to the network as a whole."
  },
  "hfXlpq": {
    "message": "Hungarian"
  },
  "hkg3fb": {
    "message": "More on effective balance"
  },
  "hlxt3T": {
    "message": "Limiting the maximum stake to {pricePerValidator} ETH per validator encourages decentralization of power as it prevents any single validator from having an excessively large vote on the state of the chain. It also limits the amount of ETH that can be exited from staking at any given time, as the number of validator that can exit in a given time period is limited. This helps protect the network against certain attacks."
  },
  "hrJ1oM": {
    "message": "You can signal your intent to stop validating by signing a voluntary exit message with your validator at any time."
  },
  "huEFUF": {
    "description": "Singular form, for only one deposit",
    "message": "You have {remainingTxCount} outstanding deposit"
  },
  "hwkLRc": {
    "message": "node operator"
  },
  "hzLd+/": {
    "message": "I understand that it is important to keep my validator online and updated."
  },
  "hzsgQ5": {
    "message": "These are also referred to as “partial withdrawals” or “reward payments” as the remaining {PRICE_PER_VALIDATOR} {TICKER_NAME} stays locked and staked."
  },
  "iCpuph": {
    "message": "Clients"
  },
  "iFWLYC": {
    "message": "You can think of the deposit contract as a transfer of funds from an Ethereum account to a proof-of-stake validator account."
  },
  "iJXdUH": {
    "message": "docs"
  },
  "iK1COM": {
    "message": "Accounts without updated withdrawal credentials will be skipped"
  },
  "iMvXLd": {
    "message": "Running the validator client"
  },
  "iN1PPs": {
    "message": "Each {pricePerValidator} ETH deposit activates one set of validator keys. These keys are used to sign off on the state of the network. The lower the ETH requirement, the more resulting signatures must be saved by the network. {pricePerValidator} ETH was chosen as a balance between enabling as many people as possible to stake without inhibiting decentralization by bloating the size of each block with signatures."
  },
  "iX90gu": {
    "message": "I've joined my execution client's Discord server."
  },
  "iXbM1G": {
    "message": "If you do not have a testnet folder it is likely you have not built and run Nimbus correctly. Run the make command again."
  },
  "iZuIgB": {
    "message": "Decompress the file you just downloaded"
  },
  "idDbou": {
    "message": "Thinking about staking?"
  },
  "ie5fDg": {
    "description": "{network} inserts the testnet name, only if on the testnet",
    "message": "Staking Launchpad {network}"
  },
  "im7uMt": {
    "message": "Consensus Layer Validator Client (VC)"
  },
  "ioj2Sj": {
    "message": "I've imported my keystore(s) into my validator client."
  },
  "iouULJ": {
    "message": "Number of empty slots (missed block opportunities, variable, typically minimal)"
  },
  "iqJ3LM": {
    "message": "PegaSys Teku is a Java-based Ethereum consensus client built to meet institutional needs and security requirements."
  },
  "iqy/7c": {
    "message": "To enable your Beacon Chain validator(s) to automatically withdraw balances to your {executionAddress}, you can use the staking deposit CLI tool to generate the signed “BLS To Execution Change” ({signed}) message JSON file. This message includes the request to change your old BLS withdrawal credentials to the new withdrawal credentials in execution address format."
  },
  "isGKnz": {
    "message": "Documentation"
  },
  "iv88b5": {
    "message": "Send all {totalTxCount} deposits"
  },
  "j2f6y2": {
    "message": "A withdrawal address has not been set for these validators. Staked funds and rewards will remain locked until withdrawal credentials are provided."
  },
  "j8GPOH": {
    "message": "Formerly known as Artemis, Teku is a consensus client built to meet institutional needs and security requirements. PegaSys is an arm of ConsenSys, dedicated to building enterprise-ready clients and tools for interacting with the core Ethereum platform."
  },
  "jBr8vs": {
    "message": "The execution address for withdrawals"
  },
  "jVlgXS": {
    "message": "Dig deeper into the Ethereum roadmap."
  },
  "jXer8/": {
    "message": "Prysm documentation"
  },
  "jYVeq4": {
    "message": "Lighthouse installation documentation"
  },
  "jecC36": {
    "message": "Public key"
  },
  "jfHMKL": {
    "message": "Connect a wallet"
  },
  "jg9gEs": {
    "message": "Make sure you do the following to get your execution client working properly."
  },
  "jjLubH": {
    "message": "Prysm installation documentation"
  },
  "jlx7pU": {
    "message": "Documentation on running Geth"
  },
  "jmKQY9": {
    "message": "Nimbus validator documentation"
  },
  "jp9OG2": {
    "description": "{ethClientType} injects \"execution\" or \"consensus\" depending on step",
    "message": "Choose {ethClientType} client"
  },
  "jrK21r": {
    "message": "You can find the binary files in {pr}"
  },
  "jrbRLT": {
    "message": "To become a validator you'll need to know about managing keys and protecting a mnemonic. If you are not yet familiar with keys and mnemonics, please do not proceed."
  },
  "jse8rl": {
    "message": "How great does my uptime need to be for my validator to be net profitable?"
  },
  "jvB4W9": {
    "message": "Environment variables"
  },
  "jytPQU": {
    "message": "Nimbus documentation"
  },
  "jztMM9": {
    "message": "deposit contract"
  },
  "k/4DOL": {
    "message": "Full withdrawal"
  },
  "k43c+l": {
    "message": "View Wagyu Key Gen audit by HashCloak"
  },
  "k4x6Ud": {
    "message": "This marked the merging of the execution layer (existing Mainnet) with the new consensus layer (the Beacon Chain) to form the single Ethereum chain of today."
  },
  "k67L48": {
    "message": "Install dependencies:"
  },
  "k8bkck": {
    "message": "EIP-4895, titled {eip4895}, implements a design that simplified this whole process for stakers."
  },
  "kFS5Sd": {
    "message": "Deposit contract formally verified"
  },
  "kGnu3F": {
    "message": "How are rewards/penalties issued?"
  },
  "kQTAe+": {
    "message": "Does the URL match what you’ve seen on other websites?"
  },
  "kRQqpE": {
    "message": "Time to complete"
  },
  "kSt9db": {
    "message": "As of the Shanghai/Capella upgrade withdrawals have been enabled on the Beacon Chain, with the inclusion of {eip}. This Ethereum Improvement Proposal enables rewards to be automatically withdrawn to the execution layer, and also provides a way for exited validators to unlock their entire balance—no gas required."
  },
  "kTt/ND": {
    "message": "Russian"
  },
  "kXhUdD": {
    "message": "Become a validator on desktop"
  },
  "kZ1+zq": {
    "message": "Teku documentation"
  },
  "ka+Ucy": {
    "message": "Network name"
  },
  "kd/f4u": {
    "message": "Key list"
  },
  "kn06Zz": {
    "message": "Monitoring docs:"
  },
  "kn7kJd": {
    "message": "More on consensus mechanisms"
  },
  "krEziQ": {
    "message": "Get in touch"
  },
  "kuYpoI": {
    "message": "Current balance"
  },
  "kv1nqx": {
    "message": "Exited"
  },
  "l/uCcX": {
    "message": "You're on the testnet"
  },
  "l4nLft": {
    "message": "I know how to check that I am sending my {TICKER_NAME} into the correct deposit contract and will do so."
  },
  "l4sDVJ": {
    "message": "exit queue"
  },
  "l5XCJW": {
    "message": "Advisories"
  },
  "l5kq/q": {
    "message": "Confirm on-chain"
  },
  "l6OJpv": {
    "message": "First, create a venv virtualenv under repository directory:"
  },
  "l926sJ": {
    "message": "If so, {excessBalanceWithdrawal} processed"
  },
  "lD66ab": {
    "message": "Outstanding deposit"
  },
  "lLOZMD": {
    "description": "{apt} and {yum} are both package manager names styled as code",
    "message": "You can install pip using a Linux Package Manager like {apt} or {yum}."
  },
  "lQzdpT": {
    "description": "this is used as a command line flag, short for \"number of validators\"",
    "message": "num_validators"
  },
  "lS9VhN": {
    "message": "Total {TICKER_NAME} staked"
  },
  "lV3Ttw": {
    "message": "Node Setup Tutorial"
  },
  "lVARlA": {
    "message": "Please enter a valid top-up value."
  },
  "lVdzDK": {
    "message": "Upload the deposit data file you just generated. The {json} is located in your {validatorKeys} directory."
  },
  "lfHCV+": {
    "message": "Nimbus is a research project and a consensus client implementation for Ethereum designed to perform well on embedded systems and personal mobile devices."
  },
  "lfV1bj": {
    "message": "Importing from Launchpad documentation"
  },
  "ljGIvm": {
    "message": "Filename destination"
  },
  "lo+Qqn": {
    "message": "change your wallet"
  },
  "lrdlY6": {
    "message": "File uploaded"
  },
  "m0FJdr": {
    "message": "Use {testnet} to sync the Holesky testnet."
  },
  "mAZHi2": {
    "message": "You can broadcast your signed message from the command line using the {curl} command:"
  },
  "mArJcj": {
    "message": "Hard drive"
  },
  "mH6bSl": {
    "message": "Since the successful transition to proof-of-stake via The Merge, Ethereum is fully secured by proof-of-stake validators. By running a validator, you'll be helping to secure the Ethereum network."
  },
  "mROPz+": {
    "message": "I provided an Ethereum address when generating my {depositData} file before depositing where I would like all validator rewards and withdrawals to be deposited into."
  },
  "mUZnem": {
    "message": "We strongly recommend you go through the entire process on a testnet first to get comfortable before risking real ETH."
  },
  "mXSzq5": {
    "message": "Option 1: binary files"
  },
  "mZOXtM": {
    "message": "Validators"
  },
  "mc27Pv": {
    "message": "A {validator} is a virtual entity that lives on the Beacon Chain, represented by a balance, public key, and other properties, and participates in consensus of the Ethereum network."
  },
  "mcyp2f": {
    "message": "More on frequency of payouts below."
  },
  "mdmA4f": {
    "message": "Number of withdrawals"
  },
  "mhyltV": {
    "message": "I've set my graffiti flag."
  },
  "mloLQ5": {
    "message": "All stakers must operate an execution client with their consensus client."
  },
  "mm+OKT": {
    "message": "The Ethereum roadmap"
  },
  "mpmFDY": {
    "message": "No pending deposits"
  },
  "mr1BWl": {
    "message": "Risks and acknowledgements:"
  },
  "mre8Tb": {
    "message": "If a withdrawal address has not been set, and you have lost access to the mnemonic seed phrase without it being stolen/compromised, your funds will remain locked in the validator account indefinitely."
  },
  "muV9Fg": {
    "message": "New validators (not yet deposited)"
  },
  "n2Dn3F": {
    "message": "Withdrawal queue"
  },
  "n4o1vR": {
    "message": "How to exit from staking (full withdrawals)"
  },
  "n5PQND": {
    "message": "Exit epoch"
  },
  "nBhisA": {
    "message": "You'll need to run an execution client (formerly 'Eth1') as well as a consensus client (formerly 'Eth2') to become a validator. Take a look at the checklist to prepare yourself and your equipment."
  },
  "nIf7QZ": {
    "message": "For this, we need active participants—known as validators—to propose, verify, and vouch for the validity of blocks. In exchange, honest validators receive financial rewards."
  },
  "nRWZl3": {
    "message": "Again, it depends. Behaving maliciously—for example attesting to invalid or contradicting blocks—will lead to your stake being slashed."
  },
  "nRdJct": {
    "message": "Continue without all transactions confirmed"
  },
  "nW+xcT": {
    "message": "Erigon documentation"
  },
  "nZTFTz": {
    "message": "I understand that there is no advantage to depositing more than once per validator. Any extra {TICKER_NAME} sent in a duplicate deposit will not be counted in my effective validator balance and I will not be able to withdraw it."
  },
  "naHAvS": {
    "message": "Enabling withdrawals"
  },
  "naZC3k": {
    "message": "Your ETH address"
  },
  "ndhFef": {
    "message": "Once you're comfortable, you'll go through generating your keys and depositing your ETH."
  },
  "njAU72": {
    "message": "French"
  },
  "njnn9P": {
    "message": "I've started running my validator client."
  },
  "nln+aO": {
    "message": "I've simulated how to safely migrate from one consensus client to another."
  },
  "ntG2by": {
    "message": "Advanced system architecture"
  },
  "nwgrRp": {
    "message": "Staking Launchpad for {TESTNET_LAUNCHPAD_NAME} testnet"
  },
  "nyOMKZ": {
    "message": "Execute with params"
  },
  "nz27+c": {
    "description": "{variables} social media platform links to Discord and Reddit (do not translate names)",
    "message": "If you have questions, EthStaker community is a good place to get help! You can find support on {discord} or {reddit}."
  },
  "o9QvTP": {
    "message": "Before you start"
  },
  "o9rUg+": {
    "message": "Withdrawals enabled"
  },
  "oDObOQ": {
    "message": "If the “eth1 withdrawal address” was not provided on initial deposit, you can submit a once-only {BTEC} message signed with your BLS withdrawal keys to specific your desired Ethereum withdrawal address. This address can only be provided once, and cannot be changed again."
  },
  "oF4os+": {
    "message": "Currently Prysm is used by >33% of the network."
  },
  "oF6xvJ": {
    "message": "EthStaker Knowledge Base"
  },
  "oLxfO1": {
    "message": "Now that the keys are imported, all that is left to do (assuming your beacon node is already running) is to run the validator client."
  },
  "oNP2EG": {
    "message": "Currently Lighthouse is used by >33% of the network."
  },
  "oNohob": {
    "message": "Configure your consensus client"
  },
  "oWBn+a": {
    "message": "Hardware suggestions are an ever-evolving target. Current minimum requirements are likely to increase by an order of magnitude after the introduction of Danksharding. Do your own research before depositing funds."
  },
  "oWhj8Q": {
    "message": "How often are rewards/penalties issued?"
  },
  "obp8vV": {
    "message": "Documentation on running Besu"
  },
  "odjJFL": {
    "message": "More on Danksharding"
  },
  "ohspQX": {
    "message": "Responsibilities"
  },
  "okGJD+": {
    "message": "Validators with a maxed-out effective balance and a linked execution withdrawal address will have any balance over {PRICE_PER_VALIDATOR} {TICKER_NAME} automatically withdrawn as excess balance."
  },
  "om4EMq": {
    "message": "To process incoming validator deposits from the execution layer (formerly 'Eth1' chain), you'll need to run an execution client as well as your consensus client (formerly 'Eth2')."
  },
  "omJNJw": {
    "message": "Warning!"
  },
  "on8WXn": {
    "message": "I've imported the dashboard config to my Grafana server and double checked that my node is alive."
  },
  "orM+1T": {
    "message": "Teku will also load validators from keystores (and passwords) from the paths found in the validator keys environment variable."
  },
  "orczlb": {
    "message": "Does the contract have a large balance?"
  },
  "ouW9ov": {
    "message": "Your validators"
  },
  "ox304v": {
    "message": "An error occurred"
  },
  "p+kDTB": {
    "message": "Ethereum users are used to transactions being executed in a manual way—if you want to transfer funds, you have to sign a transaction and pay the gas."
  },
  "p0b6zX": {
    "message": "More on Status"
  },
  "p1ynue": {
    "message": "If this was not provided, the withdrawal key can be used to sign a message declaring a withdrawal address. The withdrawal key can be generated using your mnemonic. If your withdrawal key or mnemonic have been stolen, and a withdrawal address has not yet been set, the thief will have the ability to irreversibly designate their own account as the withdrawal address for your validator."
  },
  "p556q3": {
    "message": "Copied"
  },
  "pA+UVF": {
    "message": "If you'd like to see the launchpad in another language, or if you can help translate, {getInTouch}!"
  },
  "pGnk/z": {
    "message": "Yes, but with small penalties. If you go offline for a number of days under normal conditions you will lose an amount of ETH roughly equivalent to the amount of ETH you would have gained in that period. In other words, if you stood to earn ≈0.01 ETH, you would instead be penalized ≈0.01 ETH."
  },
  "pHQwsN": {
    "message": "Launch the app from your desktop environment by double clicking on it."
  },
  "pQxML4": {
    "message": "Generate {json} file"
  },
  "pUAoW1": {
    "message": "Is the effective balance maxed out at {PRICE_PER_VALIDATOR} {TICKER_NAME}?"
  },
  "pWuGLy": {
    "message": "When a validator is scheduled to propose the next block, it performs a sweep of validator accounts looking for eligible withdrawals. During the sweep, the validator will check a max of 16,384 accounts, attempting to find 16 available withdrawals to be processed in the next block."
  },
  "pXyH++": {
    "message": "The Besu documentation explains how to download and install the client."
  },
  "pfJX2D": {
    "message": "More on phishing"
  },
  "plXBe0": {
    "message": "Alternative node tooling:"
  },
  "pnxB8A": {
    "message": "Nimbus looks for keystores in your validators folder."
  },
  "pqC+qt": {
    "message": "Slashing"
  },
  "prRNB6": {
    "message": "There was a problem trying to sign with your Ledger device. Please verify your Ledger device has both {blindSigning} and {debugData} set to {enabled}. These can be accessed by selecting the Ethereum application and then entering the {settings} menu."
  },
  "ps8lLk": {
    "description": "{expected} shows 'This is the expected scenario' and is bolded for emphasis",
    "message": "Being offline while a supermajority (2/3) of validators is still online leads to relatively small penalties as there are still enough validators online for the chain to finalize. {expected}"
  },
  "ptWiT7": {
    "message": "I've simulated how to manually stop and restart my Beacon Node (BN) and Validator Client (VC) gracefully."
  },
  "pyWt01": {
    "message": "Deposit summary"
  },
  "q0thwm": {
    "message": "As a validator you are rewarded for proposing/attesting to blocks that are included in the chain."
  },
  "q8Cxf5": {
    "message": "BLS credentials: By default, the deposit CLI would generate withdrawal credentials with the {boldWithdrawalKey} derived via mnemonics in {eip2334} format. This format is not compatible with Beacon Chain withdrawals and must be updated to Ethereum address credentials to enable withdrawals."
  },
  "qB6aU6": {
    "message": "What happened to 'Eth2?'"
  },
  "qBorVY": {
    "message": "Exit epoch and withdrawable epoch"
  },
  "qK4+NQ": {
    "message": "The terminal"
  },
  "qMePPG": {
    "message": "Note"
  },
  "qQ+Xla": {
    "message": "Korean"
  },
  "qZ59xY": {
    "message": "All validators"
  },
  "qdk7Hp": {
    "message": "Your wallet has disconnected"
  },
  "qgqVCE": {
    "message": "reconnect your wallet"
  },
  "qkEXNd": {
    "message": "Staking Deposit CLI"
  },
  "qkhah0": {
    "message": "Save the key files and get the validator file ready"
  },
  "qlwUud": {
    "message": "Exiting a {software} validator"
  },
  "qwFYIS": {
    "message": "These tools will assist you in generating the necessary keys and message to sign. Signed messages can then be {broadcastLink} into blocks."
  },
  "qwh6gM": {
    "message": "I understand the early adopter and slashing risks."
  },
  "qx+3RQ": {
    "message": "JWT"
  },
  "r/G+qN": {
    "message": "A {fullWithdrawal} is processed for any inactivated validators that are no longer considered to be staking, that have fully exited from their validation responsibilities. Thus for a validator to fully withdraw its balance, it must first complete the process of exiting."
  },
  "r0MJxb": {
    "message": "To become a validator on the Beacon Chain, you need to deposit a minimum of {PRICE_PER_VALIDATOR} {TICKER_NAME} per validator that you wish to run."
  },
  "r2BH1M": {
    "message": "Configure Prysm"
  },
  "r2j8jL": {
    "message": "validator client"
  },
  "r4JsKB": {
    "message": "Transaction successful"
  },
  "rD3ot9": {
    "message": "Phishing guide"
  },
  "rMjMmc": {
    "description": "{http} shows '--JsonRpc.Enabled true' terminal command",
    "message": "Use {http} to connect your consensus node to the JSON RPC endpoint. This will enable the JSON RPC services on the default 8545 port."
  },
  "rTSJI9": {
    "message": "Try the testnet"
  },
  "rULiIc": {
    "message": "Complete the staker checklist"
  },
  "rW+ivM": {
    "message": "More on Lodestar"
  },
  "raRw6Z": {
    "message": "Launchpad home"
  },
  "rbrahO": {
    "message": "Close"
  },
  "rs4eqr": {
    "message": "You may need to top up your validator's balance for two important reasons. If your validator's effective balance is below {PRICE_PER_VALIDATOR} {TICKER_NAME} you won't be earning your full staker rewards. And if it drops as low as {EJECTION_PRICE} {TICKER_NAME} the system will eject your validator."
  },
  "rswUPu": {
    "message": "Launchpad summary"
  },
  "s6gImC": {
    "message": "Teku can also be configured via a YAML file which is passed in via a few different ways."
  },
  "sMHQRT": {
    "message": "A consensus client with a heavy focus on speed and security. Built by Sigma Prime, an information security and software engineering firm who have funded Lighthouse along with the Ethereum Foundation, Consensys, and private individuals."
  },
  "sNUrEO": {
    "message": "If not, I've submitted a {btec} message signed with my BLS withdrawal keys to update my withdrawal credentials."
  },
  "sToVAS": {
    "message": "The block producer then checks the next validator in line, and once again determines if a withdrawal needs to be processed or not. This process is repeated until either 16 eligible withdrawals have been found, or until 16,384 validators have been checked, whichever comes first. At that point, the withdrawal queue is sent to the execution layer to be included at the end of the next block."
  },
  "sXV95+": {
    "message": "CPU and RAM"
  },
  "sZK38z": {
    "message": "Instead of a new transaction type being used for stakers to manually request withdrawals, accounts are automatically checked for eligible excess balance every few days. All validators are checked on an endless loop, and any available rewards or exited funds are automatically “pushed” into a provided withdrawal account."
  },
  "sgn0wo": {
    "message": "What happens if I have BLS withdrawal credentials and I lose my withdrawal key?"
  },
  "sj/Zef": {
    "message": "Download Key Gen GUI app"
  },
  "smD5l/": {
    "message": "Consensus Layer Beacon Node (BN)"
  },
  "smTQJU": {
    "message": "The withdrawal address for these validators will be set to {withdrawalAddress}. Make 100% sure you control this address before depositing, as this cannot be changed."
  },
  "smd9Oc": {
    "message": "Validator index"
  },
  "soCLV+": {
    "message": "Checklist"
  },
  "sraQ3P": {
    "message": "Waiting to connect..."
  },
  "sy35J+": {
    "message": "What is the deposit contract?"
  },
  "szN3Fl": {
    "message": "I understand and agree to the terms-of-service and everything stated in the previous sections."
  },
  "szh4Xy": {
    "message": "I've set up a shared JWT secret and made it available to both my execution client, and my consensus client (beacon node)"
  },
  "tJcyUM": {
    "message": "Your deposit_data.json suggests you wanted to set up more validators. These deposits are still outstanding. If you think you've already made these deposits, wait an hour before trying again to avoid duplicate deposits."
  },
  "tMHEEe": {
    "message": "Learn more about the great renaming"
  },
  "tWoq1e": {
    "message": "Maximum number of accounts that can be checked in a block. Stops when 16 withdrawals are found. If 16 eligible rewards are not found in the first 16,384 accounts checked, the withdrawal queue for that block will be submitted as is, and the following proposer will pick up where this left off."
  },
  "teyxVk": {
    "message": "What should the address be?"
  },
  "tigMuZ": {
    "message": "Wait at least 30 minutes before trying to resubmit a transaction with this {depositData} file. This will give our on-chain data source time to flag any duplicate deposits."
  },
  "tjEnDp": {
    "message": "How long the cycle takes to check every account depends on:"
  },
  "tkFTZw": {
    "message": "Balance after topping up"
  },
  "tlVvjH": {
    "message": "Become a validator with Lodestar"
  },
  "tsfX5f": {
    "message": "Confirm deposit"
  },
  "tv5Cxs": {
    "description": "{effectiveBalance} shows 'effective balance' in bold. {article}\n                    shows 'excellent post' and links to an article.",
    "message": "Note however that this scaling mechanism works in a non-obvious way. To understand the precise details of how it works requires understanding a concept called {effectiveBalance}. If you’re not yet familiar with this concept, we recommend you read through {article}"
  },
  "tzMNF3": {
    "message": "Status"
  },
  "u/3saa": {
    "message": "Your wallet is on the wrong Ethereum network. To continue, connect to {executionLayerName}."
  },
  "u28qA1": {
    "message": "After depositing"
  },
  "u564LK": {
    "message": "Portuguese (Brazilian)"
  },
  "u81G9+": {
    "message": "Uptime"
  },
  "uAXXOX": {
    "message": "This timing of this last step is variable depending on validator index, current sweep position, and number of validators."
  },
  "uDMtC8": {
    "message": "As anyone who has already gone through the process of activating a validator knows, this process is not automatic, especially if there are a lot of other users trying to join at the same time. This is because the consensus layer uses an {activationQueue} to limit how quickly new validator accounts can {join} the network."
  },
  "uEB8++": {
    "message": "Execution credentials: If you want to withdraw to your execution wallet address you can set an “eth1 withdrawal address” using {ethAddressWithdraw} when running the deposit CLI. {boldWarning}"
  },
  "uHSqYx": {
    "message": "An {excessBalanceWithdrawal} is processed when an active validator has a maxed out effective balance of {PRICE_PER_VALIDATOR} {TICKER_NAME}, and has a total balance over {PRICE_PER_VALIDATOR} {TICKER_NAME}. A single validator cannot get rewards on excess balance over {PRICE_PER_VALIDATOR} {TICKER_NAME}, and thus these accounts will have any extra balance automatically withdrawn to their Ethereum address."
  },
  "uJzGSb": {
    "message": "Make sure you're aware of how to avoid phishing attacks. We've prepared a list of things to look out for."
  },
  "uMpYkE": {
    "message": "If you provided a withdrawal address when initially generating your keys, the withdrawal key no longer has any use. The only address that validator funds can be transferred to is this address, and it cannot be changed once set."
  },
  "uNfxNg": {
    "message": "To continue, {reconnect}"
  },
  "uPECbE": {
    "message": "Validator checklist"
  },
  "uUkmGX": {
    "message": "exit epoch"
  },
  "uYF99H": {
    "message": "Although a validator's vote is weighted by the amount it has at stake, each validators voting weight starts at, and is capped at {PRICE_PER_VALIDATOR}. It is possible to drop below this with poor node performance, but it is not possible to raise above it."
  },
  "ubKWX8": {
    "message": "Generate key pairs"
  },
  "uhapiE": {
    "message": "Ensure your bandwidth can't be throttled and isn't capped so your node stays in sync and will be ready to validate when called."
  },
  "ujVT29": {
    "message": "You should now have your mnemonic written down in a safe place and a keystore saved for each of your {validatorCount} validators. Please make sure you keep these safe, preferably offline. Your validator keystores should be available in the newly created {validatorKeys} directory."
  },
  "ukfwum": {
    "message": "Become a validator with Nimbus"
  },
  "v0ygo6": {
    "message": "Testing on Holesky"
  },
  "vBJ79e": {
    "message": "I've simulated how to safely migrate from one execution client to another."
  },
  "vBOf5K": {
    "message": "Your balance is updated periodically by the Ethereum network rules as you carry (or fail to carry) out your responsibilities."
  },
  "vCHTnu": {
    "message": "Withdrawal credentials"
  },
  "vEJDo8": {
    "message": "Protect your funds using monitoring software, and learn how to handle different real world scenarios."
  },
  "vIF140": {
    "message": "Become a validator and help secure the future of Ethereum"
  },
  "vJez0K": {
    "message": "Proceed with caution. Our on-chain data source is down and we are unable to flag any double deposits."
  },
  "vPvQyf": {
    "message": "Make sure you have control over this address as this cannot be changed. Providing an account from a centralized exchange is not recommended."
  },
  "vV6ua0": {
    "message": "Step 1: Download the Wagyu Key Gen app for your operating system"
  },
  "vY2wig": {
    "message": "Loading error"
  },
  "vYODEJ": {
    "message": "Get {TICKER_NAME}"
  },
  "vYOWYI": {
    "message": "Chinese (simplified)"
  },
  "vbVsqW": {
    "description": "{stakerChecklist} = 'Staker Checklist' bolded to draw attention",
    "message": "Be sure to complete the {stakerChecklist} as soon as possible. And join the EthStaker community for support and discussion with fellow validators."
  },
  "vz8WK7": {
    "message": "This occurs 256 epochs after the exit epoch, which takes ~27.3 hours."
  },
  "w6qYSU": {
    "message": "Run the following command to launch the app"
  },
  "wJ1PbL": {
    "description": "Indicates which operating system the instructions are for",
    "message": "For {operatingSystem}"
  },
  "wJy3tO": {
    "message": "Initial setup"
  },
  "wawegX": {
    "message": "fishing rod"
  },
  "wbxk7r": {
    "message": "The Erigon documentation explains how to download and install the client."
  },
  "wdb1NC": {
    "message": "More on proof of stake"
  },
  "wm04oC": {
    "message": "Run the following command:"
  },
  "wqUcy/": {
    "message": "Early adopter risks"
  },
  "wtTeex": {
    "message": "Are there spelling mistakes?"
  },
  "wtwIax": {
    "message": "Option 2: source code + virtualenv"
  },
  "x+fF+M": {
    "message": "Testnet simulations"
  },
  "x0tVK4": {
    "message": "Validating in Ethereum is not the same as mining. The outcomes are similar: the work you do will extend and secure the chain. But the process is completely different because they use different consensus mechanisms."
  },
  "x4/9vY": {
    "message": "We strongly recommended you complete these steps on the current testnet before Mainnet."
  },
  "x4HNJL": {
    "message": "Does the site asking you for your deposit have a URL you expect?"
  },
  "xDyl3T": {
    "description": "{ethereumorg} is a link to deposit contract page on ethereum.org",
    "message": "Cross check the deposit contract address against other websites – for example: Reddit, Twitter, and GitHub. There's also a list of trusted sources on {ethereumorg}"
  },
  "xETYo6": {
    "message": "If you lose your withdrawal key, your mnemonic will be needed to recover. If your mnemonic is lost, and you have not updated your withdrawal credentials with an Ethereum (execution) withdrawal address, there is no way to access to the funds held by your validator. As such, it is essential to ensure your validator mnemonic is safely backed up."
  },
  "xGQ38+": {
    "message": "Has the validator completed the exiting process?"
  },
  "xH5GKj": {
    "message": "I am an early adopter, and I accept that software and design bugs may result in me being slashed."
  },
  "xMOzv2": {
    "message": "Anyone wishing to conclude their staking obligations can sign a “voluntary exit” message which is then broadcast to the Beacon Chain to start the process. This is a manual step."
  },
  "xP6BKs": {
    "message": "staker checklist"
  },
  "xQrU13": {
    "message": "Please review the staking checklist prior to proceeding. Use this as a guide to check off tasks as you complete validator setup."
  },
  "xSvJIi": {
    "message": "Block rewards are calculated using a sliding scale based on the total amount of ETH staked on the network."
  },
  "xXKkhR": {
    "message": "I've installed and synced my {network} execution client (do not wait on this as it can take several days)."
  },
  "xXWzDf": {
    "message": "The Beacon Chain"
  },
  "xZZMZ5": {
    "message": "testnet"
  },
  "xbet2w": {
    "message": "Install python3.7+"
  },
  "xh7oVn": {
    "message": "Those looking to exit their validator from staking and withdrawal their ETH should check out the guide below that matches your setup:"
  },
  "xm3Ivd": {
    "message": "This JSON file isn't for the right network. Upload a file generated for your current network: {consensusLayerName}."
  },
  "xns5Uh": {
    "message": "Assume you have generated deposit in {eip2334} format and have BLS withdrawal credentials. If not, you can generate it by following {docs}."
  },
  "xogY3N": {
    "message": "Besu is written in Java and released under the Apache 2.0 Licence."
  },
  "xrCRnH": {
    "message": "Example"
  },
  "xvkEAP": {
    "message": "Reth Chat"
  },
  "xxbUJa": {
    "message": "Execution Clients: {clientName}"
  },
  "xyfoga": {
    "message": "Staking withdrawals"
  },
  "xzjRos": {
    "message": "How to update validator keys"
  },
  "xzmWbJ": {
    "message": "Your validator has its own balance, with the initial balance outlined in the deposit contract. Your rewards and penalties are reflected in your validator's balance over time."
  },
  "y44jV2": {
    "message": "Several upgrades are underway that will make Ethereum more scalable, secure, and sustainable. These upgrades will improve Ethereum while seamlessly continuing on the chain of today. Here's more on the different upgrades:"
  },
  "y4dBsA": {
    "message": "Configure time sync"
  },
  "y86+cK": {
    "message": "What is a node operator?"
  },
  "yFtJza": {
    "message": "Please ensure that you have control over the keys to this address."
  },
  "yGyozY": {
    "message": "The Reth book explains how to download and install the client. We also provide versioned releases on Github."
  },
  "yI/DO8": {
    "message": "this number increases if other validators are slashed at the same time"
  },
  "yK2eQ+": {
    "message": "Minor penalties are given for inadvertent actions (or inactions) that hinder consensus"
  },
  "ySYWBD": {
    "message": "I am keeping my key(s) safe and have written down my mnemonic phrase."
  },
  "ydh1KU": {
    "message": "Language information"
  },
  "yis3aS": {
    "message": "This is the expected scenario."
  },
  "yjBvUO": {
    "message": "Nethermind is built on .NET Core. Extend it, customise it - the sky’s the limit.."
  },
  "ylZLi4": {
    "message": "EIP-2334"
  },
  "ynB6C+": {
    "message": "I'm able to connect my consensus client to my execution client via HTTP API(s)."
  },
  "yoGtkz": {
    "message": "Make sure that your node has more than 20 peers."
  },
  "yw4vsX": {
    "message": "On the other hand, you can be penalized for being offline and behaving maliciously—for example attesting to invalid or contradicting blocks."
  },
  "yzvSUC": {
    "message": "Your old BLS withdrawal credentials"
  },
  "z63I56": {
    "message": "validator"
  },
  "z6K3D6": {
    "description": "{prometheus} is 'Prometheus' service, with link to its homepage (do not translate name)",
    "message": "I've set up my {prometheus} service."
  },
  "z8zpxp": {
    "message": "Lodestar is an open-sourced TypeScript implementation of the Ethereum Consensus (formerly known as eth2) specification maintained by ChainSafe Systems. ChainSafe's goal is to develop, improve and diversify the Ethereum proof of stake ecosystem with their beacon chain and validator client with a focus on light client implementations."
  },
  "zAVb0/": {
    "message": "More on Lighthouse and Sigma Prime"
  },
  "zBl8d5": {
    "message": "{stakingDepositCli}: if you used the “eth1 withdrawal address” ({eth1WithdrawalAddress}) flag when generating your keys, you're good to go"
  },
  "zGkAVo": {
    "message": "At the other end of the spectrum, if your balance is closer to 31 ETH, it’s probably not worth adding the extra ETH required to get back to 32."
  },
  "zJicsO": {
    "message": "Staking economics"
  },
  "zbEBi9": {
    "description": "{mainnet} shows '--config mainnet' terminal command",
    "message": "Use {mainnet} to sync the Ethereum mainnet."
  },
  "zicXn7": {
    "message": "Node security"
  },
  "zkTSvw": {
    "description": "{slashings} shows 'slashings' in bold for emphasis",
    "message": "Major penalities—or {slashings}—are given for malicious actions"
  },
  "znyxZv": {
    "message": "~27 hours"
  },
  "zpmjjy": {
    "message": "Communication between the execution layer and consensus layer occurs using the {engineApi}. This is a set of JSON RPC methods that can be used to communicate between the two client layers."
  }
}